[
{"headline": "Gary Gensler Confirmed As New SEC Chair As Agency Tackles GameStop Saga, ESG Boom And Cryptocurrency", "date": "Apr 14, 2021,", "company": "gamestop", "blog_id": "blogAndPostId/blog/post/6438-6074b61dccd4f30006854b1d", "paragraphs": ["Gary Gensler, the recently approved chair of the Securities and Exchange Commission, will have his hands full as he looks to tackle the key issues of the moment including ESG investing, cryptocurrency, order routing and a fiduciary standard for brokers.", "Gensler, who previously served as chair of the Commodity Futures Trading Commission, was approved by the United States Senate on April 14 after a delay . Industry sources say he brings a reputation as an “extremely active regulator” having made it clear in his nomination hearing before the Senate Banking Committee in early March that additional disclosure requirements will be key to his approach to these pressing issues.", "Kirkland & Ellis partner Norm Champ says that increased disclosure around ESG investing should be expected following the recent announcement of a Climate and ESG task force at the SEC led by Acting Deputy Director of Enforcement, Kelly Gibson. Champ expects more onerous requirements for companies to disclose how they are handling climate risk as well as diversity. While ESG investing has exploded over the past decade, there has been scrutiny over a lack of oversight of late as its popularity continues to swell.", "Gensler will bring experience from his career in academia to bear, coming to the SEC from the Massachusetts Institute of Technology Sloan School of Management where he was a professor of the practice of global economics and management. He also served as co-director of a fintech group at the school as well as a senior advisor to the MIT Media Lab Digital Currency Initiative in between his two stints running financial regulators.", "The financial services industry is still looking for a cohesive approach on the categorization of digital assets, which depending on the regulatory body has been considered a commodity, property, currency and a security.", "While issues like ESG and cryptocurrency have been building in prominence and were certain to be top of mind for the next chair, the GameStop stock rally earlier this year fueled by Reddit thrusts issues around online brokerages and order flow onto Gensler’s docket.", "He will also be the latest head of the SEC to tackle the longstanding search for a clear fiduciary standard for financial advisors and broker-dealers that has been kicked back and forth between the SEC and the Department of Labor for a decade. He will likely work on that issue with Martin Walsh, the former Mayor of Boston who was confirmed as President Joe Biden’s pick for Labor Secretary last month. ", "The question remains whether he will strengthen the current law of the land, Regulation Best Interest, through an increased disclosure requirement or take on the larger task of reopening the longstanding debate by taking another look at the definition of fiduciary duty.", "When Gensler ran the Commodity Futures Trading Commission he was active in rulemaking, issuing more than 40 rules and only having one struck down by the courts. Many of the issues he is set to tackle were already on the radar of the SEC under Acting Chair Allison Herren Lee. The exam division featured ESG, climate risks and Reg. BI compliance in its 2021 priorities released earlier this year. Lee said the commission plans to look at order flow payments in a Feb. 25 response to a letter from Senator Elizabeth Warren.", "For now there is not much worry in financial services about the new leadership at the SEC, according to Champ, who spent nearly five years at the SEC serving as director of the Division of Investment Management, deputy director of the Office of Compliance, Inspections and Examinations and the associate regional director for examinations in the regional office located in New York.", "If Gensler surprised the industry by proposing the types of regulations championed by the likes of Senator Warren or others progressive lawmakers, it could cause panic, Champ admits. “People are taking a wait-and-see approach,” he says. ", "That being said, Champ says that he is a contrarian when it comes to the narrative that there will be some seismic shift in SEC presence between the previous and current administrations. ", "“Yes, the Trump administration was deregulatory but from an enforcement and examination perspective, the SEC was incredibly active over the last four years. It is really a disservice to the staff to say otherwise,”  Champ adds. “This narrative that there's going to be some big change in examination and enforcement is way overblown. There will certainly be more rules, but from the policing perspective the SEC has been pretty darn active.”", "However, one area where Champ expects to see a large change from the previous regime is the reemergence of the Financial Stability Oversight Council, created in the aftermath of the financial crisis as part of the Dodd-Frank Wall Street Reform and Consumer Protection Act, in order to identify and monitor excessive risks in the U.S. financial system. Gensler was active in supporting the council in his time at the CFTC and Champ concedes that the group housed within the Department of Treasury has been “dormant” over the past few years.", "His advocacy for a revival of FSOC will be aided by the Consumer Financial Protection Bureau, another agency created by Dodd-Frank that is likely to see a revival under the current administration. President Biden has nominated Rohit Chopra to the post, an acolyte of Senator Warren who helped create the bureau. The head of the CFPB, along with Gensler’s last two federal posts, chairs of the CFTC and SEC, are among the 10 voting members on FSOC.", "During his confirmation process, Gensler has not indicated his preferences to lead the five largest division within the commission, the Division of Enforcement, the Division of Corporation Finance, the Office of Compliance Inspections and Examinations, the  Division of Trading and Markets and the Division of Investment Management. Once he is confirmed, Champ expects names to emerge for those posts and with that more clarity about the tenor of his tenure."], "clicks": 14507},
{"headline": "GameStop's New Outlook", "date": "Feb 20, 2021,", "company": "gamestop", "blog_id": "blogAndPostId/blog/post/2855-6031a284eb31b50006d0a9ac", "paragraphs": ["The wild trading is over, Congress is investigating, lawsuits are being filed and the SEC is looking at short selling. So, what's next for GameStop?", "There are three components to examine for the answer to that question: Fundamental expectations, valuation criteria and stock trading possibilities. ", "GameStop's fundamental expectations are improved.", " The key ingredient is the enhanced focus on a growth strategy, spurred by the new, committed board members and fostered by new management additions capable of improving on a known brand name. Thus, GameStop is on a higher plane than when it sold for $3-5 based on the view of a weak post-Covid rebound. ", "GameStop benefits from stock market's current valuation criteria.", " In a market focused on rapid growth, favored valuation metrics go beyond earnings and sales. Those classic value measures can be misleading when a company is rapidly building its brand, products/services, locations, marketing, delivery, patents, acquisitions, etc. ", "Note: There are many companies currently in or joining this rapid growth category (e.g., the electric vehicle industry). Often, their sales are low and earnings are negative, and yet their stock prices are high and rising. \"Crazy\" investors? No, quite the opposite. It's the realization that implementing a growth strategy successfully means the payoff will come later.", "GameStop stock trading possibilities are improved. ", "When a stock is supported by non-classic valuation criteria, stock trading assumes a more important role. When a technical picture (stock chart) has familiar elements, investors are more willing to buy and hold. The trader activity helps create a robust market for the stock, thereby providing both liquidity and a visible, accepted price range.", "The current drawback: It's early days for GameStop – the company and the stock", "GameStop, the stock, just finished a wild race. This overheated engine is knocking and pinging now, trying to find a smooth, idling speed. That transition requires three ingredients: supportive fundamental news, desirable valuation measures and a confidence-building technical picture. ", "The next step is to hear about GameStop's actual plans and strategies. Likely, these will be discussed on the March earnings conference call. From that information, investors and analysts can develop expectations of where the company is headed and what the important growth criteria should be.", "The good news: A selling washout is likely", "As to the technical picture, some information is now at hand. However, the picture still contains abnormal moves and investor/trader actions. With the previous higher prices still fresh in investors' minds, there are two remaining, unstable shareholder groups: \"Hangers-on,\" who hope for a recovery (often to get back to even so as to avoid taking a loss), and \"reentrants,\" who view the current price as comparatively cheap and, therefore, hope for a repeat run-up. When the stock continues to stagnate or decline, these shareholders will sell. ", "That final selling helps establish a price foundation that becomes visible as other investors begin buying. At that point, the stock can trade without extreme moves, affirming that the previous wildness is washed out.", "The following graphs provide four different views of GameStop’s stock action.", "The bottom line", "GameStop has the potential of becoming a reconstructed growth stock. However, two developments need to occur to make the potential real:", "So, patience seems the best strategy now. Hopefully, good things will happen. It's always exciting to see a company reposition itself for the next growth uptrend instead of being mired in the past and fading away."], "clicks": 7211},
{"headline": "Gamestop, Bond Crash.  Same Thing?", "date": "Mar 10, 2021,", "company": "gamestop", "blog_id": "blogAndPostId/blog/post/4856-603abfde881a7e000660e2a4", "paragraphs": ["It occurs to me that what Gamestop and the rapid rise in long US Treasury rates (the exact subject of some of my recent articles) have one very critical thing in common: ", "they involve a group of investors, formally or otherwise, crowding into the same trade all at once, thereby pushing \"conventional wisdom\" to the side. ", "In the case of Gamestop, a now-famous group of traders on the Reddit app decided that they could, by sheer numbers and force, push up the price of a stock in a rapid and vicious fashion. Part of this had to do with their belief that such a buying flurry would force “short sellers,” investors who aim to make money when a stock’s price falls instead of rises, buy the stock back to “cover their shorts,” perpetuating the stock’s rise. ", "To steal a line from the show “School of Rock,” what a way to stick it to the man! In this case, the “man” was one or more hedge fund managers who were known to have been short the stock. You can read all about this to your heart’s content elsewhere on Forbes.com. ", "For me, the irony is that at the same time this unique type of crowd-funding effort to break hedge fund managers was happening, there was another story brewing, way over in the bond market. Long-term interest rates were doing their best meme-stock impersonation, and moving up at a historically-rapid rate. ", "The 10-year U.S. Treasury rose from 0.50% in the middle of last year, to a recent peak of about 1.60% in late February. Much of that surge came in just a couple of weeks. ", "This was enough to put the normally sleepy bond market on the front pages of the financial news. I was glad to see this, if for no other reason than what it means at this type of peak euphoria for day-trading and other Dot-Com Bubble era habits that investors adopt.", "After all, trading is for traders, and investing is for investors. There is some crossover, but I lament the fact that in 2021, few market participants can tell the difference. This sows the seeds of eventual regret. As the old expression goes, one definition of a long-term investor is a disappointed speculator.", "It is not surprising to see that the spike in Treasury rates and the manic activity in Gamestop and other stocks come at the same time. This is the era we live in, where any investment can go from calm to hyperactive in days. ", "There is also a “man” that investors may be “sticking it to” when it comes to the lift in Treasury rates. The U.S. Federal Reserve sets very short-term interest rates. Who sets the rates on 10-year, 20-year and 30-year bonds? The bond market! So, perhaps the message in what we see in bonds lately is this: Hey Fed, if you won’t do something to stop suppressing interest rates and return the economy to some normalcy, we, the bond market, will!", "Like Jack Black’s classroom full of kids in the movie version of School of Rock, the atmosphere is increasingly charged up. That should put every investor on notice. ", "This sets up for potentially the best investment climate in recent memory, IF you can do two things that most investors have yet to focus on sufficiently. First, develop a strategy for hedging portfolios. Second, embrace a process for managing a portion of your portfolio tactically. That is, a process whereby you “rent” investments for weeks or months instead of “owning them” for years. ", "It seems to me that the investment world focuses too much attention on both “buy and hold forever” approaches and very short-term (minutes/hours/days) than the types that occupy the middle. Today’s markets operate differently. There are different players, different motivations and social media and technology to disrupt the old rules.", "This calls for enhancing your approach with a mentality that includes succeeding in that middle time frame of weeks to months, and doing all you can to avoid major drawdowns in value along the way. It is in the middle that so much of the profits may be made in the period ahead. And since Gamestop, Treasury Bonds and other market trends are increasingly part of this new wave of investment activity, it behooves us to better understand it.", "In the bond market? Same thing, different investing group! In that case it is the bond market essentially telling the Fed that if the Central Bank continues to do nothing about suppressed interest rates, rising commodity prices, and endless government spending, they will. As I noted in my last article, the Fed controls overnight rates, but the bond market determines the rate of the benchmark 10-year Treasury Bond, and the 30-year Treasury Bond that so many mortgages are tied to.", " ", "The power of the herd is not a Gamestop story. It’s the story of a market that has been pushed to the limit, bubbled up across stocks, bonds, corporate debt, government debt, consumer debt and now, speculative investor excess. ", " ", "For meme stock holders, they risk a quick return to reality. For bond investors and 60/40 allocation fans, it is just the opposite. It might just be the long overdue reversion to the mean for the bond and stock markets. For financial advisors, they either get in sync with that possibility and start learning how to navigate through it, or they will be hearing the phrase \"career risk\" a lot, the same way over-leveraged hedge fund managers do when bubbles pop.", "Comments provided are informational only, not individual investment advice or recommendations. Sungarden provides Advisory Services through Dynamic Wealth Advisors."], "clicks": 1354},
{"headline": "Losing Touch With Reality – A GameStop Lesson", "date": "Mar 9, 2021,", "company": "gamestop", "blog_id": "blogAndPostId/blog/post/50079-6046a7782cc09600064df9a8", "paragraphs": ["Before long, the saga of the GameStop run of 2021 will be studied in economics and investment classes. If you were off grid for the last month, and are not up to date on this story, there are hundreds of articles out there that describe the circumstance of how small retail investors got together on a little known internet forum called “wallstreetbets” and ultimately drove interest and pricing on GameStop’s public stock to unexpected highs. The GameStop stock (Stock Symbol: GME) ended last year near $18 a share but soared as high as $483 in late January 2021. After falling back and trading below $40, the stock then jumped back up in a “Round 2” ramp—along with other popular stocks targeted on Reddit—to $194.50 as of this writing. ", "Many at Wall Street hedge funds were caught in short selling positions, having to cover the differences in prices between the low price they bet on in their “put” options, and the actual price as their options were set to expire. This forced the hand of the hedge funds involved to “cover” their short bets, and purchase the stock at very high prices. One of the hedge funds, Melvin Capital, lost 53% of its value, and had to receive an emergency cash infusion of $2.75 billion. Needless to say, these activities cost these hedge funds billions of dollars as the damage reports and aftermath are still coming in. In a recent article “", "Warnings For Tech Giants And An Ode To A Simpler Web", ",” I called out the ongoing threat of bots and lack of authenticity that is pervasive across platforms such as social networks and forums such as Reddit, Twitter, Facebook, etc. This is an identity and integrity problem that has the potential to cause untold damage in addition to posing an experience issue.", "The GameStop episode has been labeled as a showdown between Wall Street and Main Street. Events played out on the Reddit forum wallstreetbets in a way that corresponded with massive surges of activity, leading many to believe that automated “bots,”  or “pretend users,” helped exacerbate the conditions that ran up the price. The roots of these circumstances within the forum dated back to the middle of 2020, when interest in GameStop investment began to gather momentum. ", "Major investment firms followed the track of publicizing the expectations that the stock would soon be worthless, in a story similar to Blockbuster Video. Typically, this is something they can make true through the presence of investment movement and the open positions that occur when this happens. When the short sales options became due and the price did not match expectations, the hedge funds who expected to win lost big.", "Before long, “Big Tech” intervened with a heavy hand as it has been doing lately, shutting down forums and conversations in places where they popped up. Trading firms, such RobinHood, E*Trade, and others even stopped and curtailed trading in the stock. This saga rose to such prominence, that culminated with hearings in front of Congress.  However, those hearings were a late damage control response attempt that neglects a major issue affecting the majority of experiences on the web nowadays, which is lack of authenticity. Congress, along with “Big Tech,” still missed that point for whatever reason.", "The openness of the social media platforms to malfeasance is a persistent issue. It is difficult to ascertain safety and authenticity when engagements on many platforms are completely anonymous and unauthenticated. Who is a friend? Who is a foe? Or the equally important question—who is a bot and part of a bot farm in an effort to manipulate results? Bot farms exist, and are sponsored not only by criminal enterprises but also by state-actors.", "Bots and bot-based activity are a significant threat to not only the personal privacy and security of the average person, but also the valuation of well-known companies like GameStop, AMC, BlackBerry, etc. The public is engaged in a virtual congregation and exchange of information that could literally be anybody, from anywhere or any automated program. These bots open the door to threats that include:", "As a population, we have a pretty good handle on malicious email activities, but bot activity must be brought into check now  especially in online forums and social media. There seems to be a lack of will by companies like Facebook, Twitter, and Reddit to do so.  With a lack of measures to assure a genuine base of users, trolls and opportunists will leverage any crack possible to jump into the stream and corrupt conversations to their needs. Every account should be validated and traced to an actual individual and in obvious cases, an actual business or organization. What we are seeing is the product of nothing but purposeful neglect and a gap in the mission of what online interactions were built for. ", "It is time to gather around the principles of “who” these platforms are for. Are online forums designed around the experience of having shapeless, anonymous bots consuming online engagements? Can the same be said for social networks? Do you have any idea who is behind the public comments that drop into your Twitter posts? Many people think they do, but the simple fact is that we engage in a virtual world where there is little validation and the experiences we engage in may not be human or genuine in nature. ", "The GameStop situation clearly illustrated that major networks and forums should be regarded as potential risk points. Every one of these risk points should be contextualized in terms of impact and the effort required to ensure a genuine experience and open exchange of ideas. Various technologies can help the effort towards a genuine web. For example, multi-factor authentication, account validation, biometrics, preemptive security monitoring, and other leading technologies provide ways to do this on financial websites. It would only take the will of the social media  giants (with the help of technology) to improve the experiences and impact of these public meeting places in a positive manner. Authentication will bring authenticity to our conversation. Authenticity will bring accountability. Accountability will bring sanity."], "clicks": 10404},
{"headline": "From GameStop To Karen, How Our Memes Reflect Social Inequality", "date": "Apr 1, 2021,", "company": "gamestop", "blog_id": "blogAndPostId/blog/post/50246-605b9a780a1579000600d588", "paragraphs": ["On January 5th, in a ", "Forbes ", "prediction ", "piece", " for 2021, I forecasted the fall of Robinhood and the rise of Reddit. ", "Right on.", "However, little did I realize how quickly these foresights would manifest, and secondly, how they’d be so intertwined.", "The GameStop r/WallStreetBets ", "headlines", " took the world by storm due to the unexpectedness and speed of the development. In just days, a group of Redditors challenged coveted hedge funds and the historic stock market. The establishment was less fortified than we thought.", "But the story was in the works for years.", "Beneath our fast-headline veneer of pop culture, a tectonic plate has been shifting. The pandemic, inflaming this shift, has made today’s headlines and sentiment all the more volcanic. But after the last couple years of eruptions, the source is clear.", "Everywhere we look in culture rampant, institutional injustice and inequality is catalyzing action.", "COVID-19 spotlit our exacerbating ", "inequality", ", the driver of every social movement of the last 700 days and the fuel for each one moving forward.", "On both a global and national level, densely populated and poor areas were hit hardest by the pandemic, while low-wage workers were disproportionately affected by subsequent layoffs. It’s also been revealed that nationally, cases and deaths of COVID-19 for Black, Hispanic and Native American populations ", "occurred", " at higher rates. As you could guess, inequality also applies to our ", "vaccine", " rollout.", "Meanwhile, billionaires' wealth rose to ", "$10.2 trillion", " and ", "45", " of the 50 largest U.S. companies turned a profit since March 2020. Further, millions of high income employees continue to work comfortably at home, spending more time with family. Commute times shrunk, while savings ", "soared", ", and Peloton, the luxury home-fitness company, can’t keep up with ", "demand", ".", "When we discuss mixed reality, we conjure VR devices or our media echo chambers constructing competing truths. But mixed reality is most accurate when we consider our truly conflicting livelihoods and outlooks of the world. Our everyday reality is not the same as others’ at the top.", "Reflecting and connecting the dots around this divide, inequality is consistently at the center of our largest stories.", "Many labeled the GameStop buyers as gamblers. After all, Robinhood is just the ", "white-collar brother", " of DraftKings. But for many, holding GameStop was another flavor of activism in 2021.", "Whether due to watching their parents get robbed of the American Dream in the 2008 Great Recession, or getting sold an over-priced higher-education only amounting to un-escapable debt, there’s acute and unresolved financial resentment. This animosity is aimed at neither parents nor professors, but at the ", "system", " which set up this game. The Man.", "James McCombs, a member of r/WallStreetBets shared that he was not motivated by the profits of the GameStop stock, but by the ability to punch ", "up", ", back at the firms which led us to the global financial crisis. \"Now we have an opportunity to take it back,\" ", "says", " McCombs. It’s beyond dollars and cents. It’s about power. Media theorist, Douglas Rushkoff ", "writes", ", “[It’s] simply to make the billionaires pay.”", "We’re mistaken to think that Wall Street is the only target or manifestation of The Man.", "When George Floyd was killed in May, a summer of protests were lit by not the actions of four murderers, but again by a ", "system", ". This time a system of perpetual racism, abuse and brutality. It’s ", "the system ", "which led to those eight minutes and forty-six seconds. To this idea, the shared rallying cry ", "#ACAB", " was not aimed at just those directly involved, but at ", "all", ". A collective. The structure.", "As Victoria Gagliardo-Silver for The Independent ", "put it", ", “Social media is the enemy of American police.”", "But substitute any institution with “police” and the quote still holds up.", "Zoom out, and we see a pattern emerge. Where there’s an injustice of inequality, there’s social media. Equipped with the tools of creation, organization and amplification, when community forms, mountains are moved. The old guard is seemingly powerless against a subreddit, hashtag or even meme.", "Amy Cooper", " of Central Park and Jennifer Schulte AKA ", "Barbecue Becky", " are both Karens, ", "\"", "obnoxious, angry, entitled, and often racist middle-aged white women” — a ", "top 2020 trend", " for Dictionary.com.", "Hurled as a slur by Millennials and Gen Z, “Karen” jabs at the unprogressive and sheltered. More precisely, it’s an acknowledgement of the too frequent abuse of privilege.", "Apryl Williams, a faculty associate at the Berkman Klein Center for Internet & Society, ", "sees", " ideologies from the slave days underlie the practices of Karens.", "“By turning Karen recordings into memes, internet creators are drawing attention to these common acts of aggression that may otherwise be overlooked — and holding the women accountable for their actions.”", "The scorn is not fueled by soccer moms with harsh blond highlights, but rather by the ideologies which they perpetuate.", "Karenism is the rejection of conservatism.", "“Ok Boomer” is just another flavor of Karenism and activism. Again, inequality and social media remain at the center of the movement. It’s a jab at not just archaic ideologies, but ", "senile", " ones. It’s viral generational shaming and blaming fueled by crises.", "Shannon O’Connor, maker of the now iconic “Ok Boomer” hoodie ", "shares", ", “The older generations grew up with a certain mind-set, and we have a different perspective. A lot of them don’t believe in climate change or don’t believe people can get jobs with dyed hair, and a lot of them are stubborn in that view. Teenagers just respond, ‘Ok, boomer.’ It’s like, we’ll prove you wrong, we’re still going to be successful because the world is changing.”", "When COVID-19 was quickly coined “", "The Boomer Remover", "”, the meme became more than a pejorative, but a clear manifestation of the grudge against The Man — those who led us to this point and continue to make the ", "wrong", " decisions.", "“F*ck these people who created this environmental, financial, and oppressive mess. The one which ", "I’ll", " be forced to live in and clean up for the rest of ", "my", " life. What worked for them does not work for me. Okay, Boomer.”", "Celebrity doesn’t grant immunity. They’re just another target.", "When Kim Kardashian hosted a surprise island getaway mid-pandemic, her advertised privilege was rightfully met with envy and fury. #sponsored", "“I surprised my closest inner circle with a trip to a private island where we could pretend things were normal just for a brief moment in time.”", "Kim K’s normal is the 99%’s abnormal. That Kim doesn’t comprehend ", "this", " is just more fuel for the fire. But the truth of the matter is her post didn’t change much. Celebs sealed their fate with their March 18th ", "rendition", " of “Imagine” by John Lennon. We’re certainly not #InThisTogether.", "Weeks later Ellen made matters worse when she ", "cried", " in her mansion, “It’s like being in jail.”", "Radical, QAnon’s fixation upon celebs is just another illustrative point in our global disdain towards the powerful. Winfrey, Gates and Hanks. Notoriety is correlated with conspiracy.", "Celebrity is another out of touch institution, just sparkly.", "Comedian Bill Burr ", "joked", ", “[GameStop] was essentially the #MeToo movement of the stock market.”", "Whether it’s Weinstein or bankers, the people are rising up to hold vile power accountable. Enough.", "It used to be, whatever celebs touch turned to gold. Now, what they touch rusts. The ", "Super Bowl", ", ", "Oscars", " and ", "Grammys’", " ratings have been in free fall for years as the masses question why we’ve been worshipping false idols. Younger demographics are not just tired of award shows and mediums like cable, but specifically the ruthless inauthenticity injected into them.", "For younger demographics, exciting social media driven alternatives look like Patreon, OnlyFans, Substack and YouTube, which now hosts over 30M “channels” uploading ", "500 hours", " of content every minute. When we’re each a creator, there’s then something for each of us. Organic, bottom-up content resonates. We’re the ", "director", ".", "In author Ben Mezrich’s ", "words", ", “Waging war against Big Finance by becoming a day trader is like waging war against the casino industry by becoming a gambling addict. Even if you’re winning, you’re still participating in a broader casino economy — buying drinks, eating dinner, throwing chips to dealers, filling out tables — that, over time, guarantees that the house keeps winning.”", "At the House Financial Services Committee’s five-hour ", "hearing", ", chairwoman, Maxine Waters, (D-CA) amplified this sentiment, “Many Americans feel that the system is stacked against them, and no matter what, Wall Street always wins.”", "When Robinhood, the tool to democratize power, is the one to sell its ", "customer’s data", " and ", "curb", " the movement — no matter its reasoning — we must question who’s ", "really", " working for us. ", "We’re right to doubt who’s on our team. It’s as if the dehumanizing, authoritarian elite are omnipresent.", "In 1971, Townshend of ", "The Who", " warned us of these moments:", "Take a bow for the new revolution, Smile and grin at the change all around", "Then I'll get on my knees and pray, We don't get fooled again", "Meet the new boss, Same as the old boss", "We can listen to ", "The Who", ", or we can author the future we want.", "Think it’s impossible to get a ", "truly", " new boss? Trump.", "In ", "The Revolt of The Public and the Crisis of Authority in the New Millennium", ", Martin Gurri writes:", "“From start to finish, the 2016 presidential race can best be understood as the political assertion of an unhappy and highly mobilized public. In the end, Trump was chosen precisely because of, not despite, his apparent shortcomings. He is the visible effect, not the cause, of the public’s surly and mutinous mood. Trump has been for this public what the objet trouvé was for the modern artist: a found instrument, a club near to hand with which to smash at the established order.”", "We’re getting closer. There’s a trend. We just overshot it with Trump.", "We’re evidently in control of our existing systems, and also in complete control new ones waiting to be built—ones which could ", "absolutely", " work on our behalf.", "We’re more powerful than we give ourselves credit for. And we naturally keep getting the same boss if we permit it.", "Power to the players only becomes ", "true", " when the power is finally taken back. It’s waiting."], "clicks": 543},
{"headline": "GameStop’s Day Of Reckoning May Have Arrived", "date": "Mar 24, 2021,", "company": "gamestop", "blog_id": "blogAndPostId/blog/post/2464-605ad77137856700061fdd30", "paragraphs": ["GameStop announced its ", "January fiscal fourth quarter results", " after the market closed on Tuesday and results were a bit light. Revenue of $2.12 billion were short of the expected $2.21 billion and EPS, which was expected to be $1.35 on an adjusted basis, came in at a reported $1.27 but were helped by $1.03 in tax benefits. While it is only a small miss if the analyst were incorporating the tax help, it would be a huge miss if they were not.", "Global E-commerce sales increased 175% in the quarter and 191% for fiscal 2020 but these results were expected since the ", "company announced its holiday sales", ".", "While not giving guidance is not a surprise, doing away with same store sales is to a degree understandable but it is a disappointment. Not answering questions and ", "filing in its 10-K", " that it may sell additional shares crushed the stock in the after-market.", "The stock has fallen the past four days from $209.81 to $181.75 and is down over $27 in the after-market to $154. ", "Balance sheet and cash flow were solid", "GameStop’s balance sheet and cash flow were solid for the year given everything it had to navigate. While non-restricted cash was essentially flat over 12 months debt fell by about $80 million (and restricted cash increased by $110 million).", "Operating cash flow turned positive to $124 million, but this was due to the company significantly decreasing accounts payables and accrued liabilities. And free cash flow was positive coming in at $64 million but it may be hard to replicate this going forward. This may be one of the reasons management and the Board are considering selling shares.", "Will a different game plan be enough", "George Sherman, GameStop’s CEO, said, “we are excited by the opportunities that are in front of us as we begin prioritizing long-term digital and E-Commerce initiatives while continuing to execute on our core business during this emerging console cycle. Our emphasis in 2021 will be on improving our E-Commerce and customer experience, increasing our speed of delivery, providing superior customer service and expanding our catalogue.”", "GameStop is making very good progress with its E-Commerce initiatives as seen with the huge increase in sales the past quarter and year. The challenge is to keep up such a steep ramp since it comprised 34% of net sales in the quarter vs. 12% a year ago. There will be some very tough comps later in 2021.", "Revenues should turn back to some amount of growth, but given the shares rich valuation due to the Reddit crowd helping to goose the stock up it may not be enough to satisfy investors.", "The fundamental numbers still don’t make sense", "Before Covid-19 derailed the U.S. and worldwide economies GameStop was slowly losing revenue from fiscal 2016 to 2018 then had a sharp drop-off in fiscal 2019 (ended in January 2020). GameStop may be able to shake up its business enough to recover at least some of downturn but it won’t happen overnight.", "Note that while GameStop’s fiscal year ended on January 30, 2021, and would normally be labeled fiscal 2021, GameStop calls it fiscal 2020.", "When calculating the company’s valuation metrics these results use fiscal 2018’s $8.3 billion in revenue so as to be as generous as possible.", "Short squeeze is a minor, if any, player recently", "While the Reddit crowd helped to create a short squeeze on the shares in late January leading the stock to reach $483 intra-day and close at an all-time high of $347.51, the recent increase to March 10’s close of $265 is probably not due to short positions having to be covered. Note that the stock has traded down 7 of the past 9 sessions and is poised to be down again today.", "Ihor Dusaniwsky, Managing Director at Predictive Analytics, estimates how much short interest there is in a stock on a daily basis. His analysis shows that the first big run-up in the shares in late January/early February essentially forced the shorts to cover and dramatically reduce their positions. ", "At the beginning of the year the stock was under $19 (right axis/green line in the chart below) and Dusaniwsky estimates that there were over 70 million shares shorted (left axis/orange line in the chart below). Since there were 69.7 million shares outstanding as of December 1 last year there was a power keg ready to blow on the stock.", "In late February his analysis shows that there were about 15 million shares shorted before the stock started its recent rise. With almost 24 million or more shares traded every day from February 24, the start of the recent run, to March 16 it doesn’t appear that short covering has been a major driver.", "Note that the analysis is of last Wednesday, March 17."], "clicks": 1493},
{"headline": "GameStop’s Sudden Move Higher Is Another Trap", "date": "Mar 16, 2021,", "company": "gamestop", "blog_id": "blogAndPostId/blog/post/2464-605054231b7ed00006ed29c0", "paragraphs": [" ", "In less that two weeks, GameStop’s stock spiked from $101.74 on the last trading day in February to close between $260 and $265 on March 10 to 12. It did pull back over $44 on Monday to close at $220.14, still more than double from its end of February price.", "One of the reasons for the move last week was the ", "company announcing", ", “its Board of Directors has formed a Strategic Planning and Capital Allocation Committee to identify initiatives that can further accelerate the Company’s transformation. The Committee is comprised of Alan Attal, Ryan Cohen, and Kurt Wolf, with Mr. Cohen serving as Chairperson.” Cohen is the activist investor who joined the Board in January and is leading the charge to make GameStop more of an e-commerce company. ", "GME is a highly volatile stock", "After a peak close of $347.51 on January 27 and an intra-day high of $483.00 the following day, it only took three days for the stock to close at $90, down 74% and 81%, respectively. And only another two days to close at $53.50, down 85% from the peak close and down 89% from the peak intra-day high.", "Keep in mind that last Wednesday the stock closed up just over $18 to $265 but traded between $172 and $348.50 during the day. It is HIGHLY unusual for a stock to drop over 50% during a single trading session and then recover the loss when there isn’t any fundamental news on the company. If one isn’t prepared for this type of activity, which can lead to large losses, don’t buy it.", "Short squeeze is a minor, if any, player recently", "While the Reddit crowd helped to create a short squeeze on the shares in late January leading the stock to reach $483 intra-day and close at an all-time high of $347.51, the recent increase is probably not due to short positions being covered.", "Ihor Dusaniwsky, Managing Director at Predictive Analytics, estimates how much short interest there is in a stock on a daily basis. His analysis shows that the first big run-up in the shares in late January/early February essentially forced the shorts to cover and dramatically reduce their positions. ", "At the beginning of the year the stock was under $19 (right axis/green line in the chart below) and Dusaniwsky estimates that there were over 70 million shares shorted (left axis/orange line). Since there were 69.7 million shares outstanding as of December 1 last year there was a power keg ready to blow on the stock.", "In late February his analysis shows that there were about 15 million shares shorted before the stock started its recent rise. With 25 million or more shares traded almost every day since February 24, the start of the recent run, it doesn’t appear that short covering has been a major driver.", "The fundamental numbers still don’t make sense", "Before Covid-19 derailed the U.S. and worldwide economies GameStop was slowly losing revenue from fiscal 2017 to 2019 then had a sharp drop-off in fiscal 2020. GameStop may be able to shake up its business enough to recover at least some of downturn but it won’t happen overnight.", "When calculating the company’s valuation metrics these results use fiscal 2019’s $8.3 billion in revenue so as to be as generous as possible."], "clicks": 41274},
{"headline": "Gamestop Shares Surge 10% After CEO Shakeup", "date": "Apr 19, 2021,", "company": "gamestop", "blog_id": "blogAndPostId/blog/post/5866-607d8ff87135e000063bbc5c", "paragraphs": [], "clicks": 1849},
{"headline": "Bright Side Of Short Selling: GameStop, Tesla And Beyond", "date": "Mar 30, 2021,", "company": "tesla", "blog_id": "blogAndPostId/blog/post/7545-603284ce16ab2c0006d26336", "paragraphs": ["Short sellers are often vilified in the investing world because they profit from a stock price decline. The fight between corporate insiders and short sellers is nothing new. Elon Musk's ", "fight with Tesla short sellers", " captured the headlines for a long time. Bill Ackman's billion-dollar short ", "bet against Herbalife", " is another iconic example of such a fight. In recent months, the trading frenzy at GameStop (", "GME", ") has again prompted a lot of discussions on the role of short sellers in the market. Despite the common narrative that short sellers are to blame for stock market manipulation and price decline, a healthy dose of short selling is vital for well-functioning capital markets. ", "An efficient capital market, where prices reflect accurate information about the company's fundamentals, allows CFOs to raise funds at an attractive price in the long run. Informationally efficient capital markets are also good at allocating capital to its best use: giving money to fundamentally strong firms while rationing it for the weak ones. Short sellers make an important contribution in making prices efficient, and therefore in the efficient allocation of capital across firms.", "Since the short sellers profit from a price decline, they have strong incentives to discover bad news such as corporate wrongdoing, mismanagement, and accounting fraud. For informationally efficient capital markets, the discovery of bad news is as important as the arrival of good news. The CEOs and CFOs of a firm have all the incentives to release good news. It is the short sellers, and sometimes the regulators, who are in the business of discovering bad news and making markets more efficient in the process. Improved information efficiency that comes from the discovery of bad news helps good corporations separate themselves from bad ones. In the end, such a separation allows fundamentally strong firms to raise capital at an attractive rate. ", "Months before the collapse of Lehman Brothers, short seller David Einhorn made a famous speech describing some accounting ", "discrepancies", " in Lehman’s 2008Q1 accounting statements. In September of the year, the truth came out, and Lehman's failure was for everyone to see. Early and accurate discovery of negative information can help investors, regulators, and CFOs alike. Academic research finds overwhelming evidence supporting the positive role short sellers play in ", "improving market efficiency", ". ", "There are two other benefits of short selling that go beyond the discovery of bad news. Fearing these discoveries by short sellers, firms are likely to be more careful with their disclosures and corporate decisions in the first place. With their backs against the wall, corporate managers are likely to make better decisions when faced with heavy short-selling pressures. Such a disciplining effect improves the overall quality of corporate reporting, and it can also result in better performance in the long run. Tesla’s recent performance can be partly attributed to this disciplining effect of short sellers. ", "Second, short sellers play a vital role in keeping price bubbles under control. Stock investors can be broadly classified into two groups: optimists and pessimists. Optimists, who are bullish on the firm's prospects, can easily voice their opinion by buying more shares of the company, contributing to further price rise. Pessimists, on the other hand, can only voice their opinion by selling shares. In the absence of short selling, a pessimistic investor can only voice her opinion if she already has the stock in her portfolio. Therefore, a restriction on short selling activities will significantly decrease their ability to incorporate their views in the stock price. As a result, the stock price will reflect the views of optimistic investors only, potentially creating an unsustainable price bubble.", "GameStop's share price has experienced large swings in recent months. If short sellers are unable to borrow and short the company's stock, there is a possibility that the price level only reflects the opinion of bullish investors. Therefore, the share price can be artificially inflated. Only time will tell whether the current price level is justified or not. Still, we certainly need some short sellers to ensure prices are close to the fundamental value, reflecting both optimists' and pessimists' views.", "There is always a concern that short sellers may not be investing based on fundamental information; instead, they may be trying to manipulate the stock price through their trading. Such manipulative short selling is undoubtedly harmful to the markets. We need better regulation to curb manipulative practices. But, as a whole, there is a lot to gain from short sellers in a vibrant capital market."], "clicks": 6505},
{"headline": "Facebook, Apple, And GameStop Among Today’s Trending Stocks", "date": "May 19, 2021,", "company": "gamestop", "blog_id": "blogAndPostId/blog/post/50076-60a53250bb65f900064ac3f7", "paragraphs": ["Remember the GameStonk short squeeze of early 2020? If early indications are correct, that marvelously awful event that saw hedge funds lose billions and average Joes rack up startling portfolio profits overnight is about to make a sudden reappearance. ", "See what else is trending this fine Tuesday with Q.ai’s roundup of high-investor interest stocks. ", "Q.ai", " runs daily factor models to get the most up-to-date reading on stocks and ETFs.", " Our deep-learning algorithms use Artificial Intelligence (AI) technology to provide an in-depth, intelligence-based look at a company – so you don’t have to do the digging yourself. ", "Sign up for the free Forbes AI Investor newsletter ", "here", " to join an exclusive AI investing community and get premium investing ideas before markets open.", "First up on our trending list is ", "Facebook, Inc", " \n ", " \n  ", "FB", " \n ", ", which closed down 0.15% on Monday to $315.46 per share with 15 million trades on the books. This comes out over $5 above the 22-day average, with the stock trading up almost 15.5% YTD. ", "However, there may be trouble brewing once more for the oft-criticized social media giant, as a group of U.S. Democrats urged the company to ", "drop plans", " for a version of photo-sharing app Instagram for children between the ages of 6 and 12. Their objection comes on the heels of last week’s protest, wherein a group of 40 state attorneys general also urged Mark Zuckerberg to abandon ship before it sets sail. ", "At the same time, Facebook also announced the launch of Live Shopping Friday. Throughout this three-month event, well-known beauty and fashion companies like Sephora and Abercrombie & Fitch \n ", " \n  ", "ANF", " \n ", " will host live events to entertain and demonstrate products to viewers, providing a way for major brands to reach clients where they are: Facebook. ", "Facebook is taking these gambles on the back of a strong 2020. Revenue grew 9.8% in the last fiscal year, though not quite matching pace with the 69% growth over the last three, bringing total revenue from $55.8 billion to $85.97 billion. Forward 12-month revenue is expected to grow by 3.71%. ", "Facebook’s operating income also grew last year by 16.8% to $32.67 billion, with per-share earnings expanding 15.7% to $10.09. However, the company’s ROE dropped from 27.9% to 25.4% over the last 36 months. Currently, Facebook is trading at 23.7x earnings. ", "Our AI is generally favorable on Facebook, given the company’s 5-year track record of high share prices and continued innovation. Facebook has earned ratings of A in Growth, B in Low Volatility Momentum and Quality Value, and C in Technicals. ", "Next up is ", "Ampco-Pittsburgh", " ", " \n  ", " \n   ", "AP", " \n  ", ", a leading manufacturer and retailer for engineered and specialty metal products and equipment, closed up 8% on Monday, starting the week at $7.00 per share with 133,135 trades in the bank. Despite some waffling in recent weeks, as seen in the 10-day average of $6.87 and 22-average of $6.94, Ampco-Pittsburgh is up almost 27.75% YTD. ", "While Ampco-Pittsburgh has a long way to go yet before they approach their three-year-ago performance, the company appears to be doing well, as CEO J. McBrayer just shelled out $65k to increase his stock holding by 14%. ", "Ampco-Pittsburgh experienced an abysmal 2020 to follow a slightly more abysmal 2019 (if that’s even possible). The company’s revenue decreased from $419 million to $328.5 million in the past three years, with operating income halved from just under $11 million to $5.5 million. At the same time, EPS plummeted from $5.57 to $0.54 in per-share earnings. ", "As you might expect, our AI is skeptical of Ampco-Pittsburgh’s long-term performance. The steelmaker is admittedly making strides toward their once-great stock prices – but with a long road ahead of them, they’ve earned mediocre ratings of A in Quality Value, D in Low Volatility Momentum, and F in Technicals and Growth. ", "American Airlines Group", " ", " \n  ", " \n   ", "AAL", " \n  ", " closed out Monday with 40.7 million trades, trading up 4.2% to $23.35 against the 22-day price average of $21.56. Currently, the stock is up 48% YTD. ", "American Airlines is trending this week in part due to a statement Sunday that announced they’re expanding their quarantine-free flight list. While the company has been offering quarantine-free flights from JFK airport to Italy since early April, recent changes in Italy’s travel restrictions allow any eligible customers to take these flights starting May 16. All that’s required is proof of a negative Covid-19 test before departure and upon arrival. ", "This positive news is welcome not only for cooped-up Americans, but those who see reopening international travel as the end of the pandemic. And that’s good news for American Airlines, whose 2020 year was marked by plummeting revenues and share prices alike. ", "American Airlines raked in revenue of $17.3 billion in the last fiscal year, a sorry amount compared to $44.5 billion three years ago. Still, their operating income managed to expand 17.5% to $11 billion compared to $3.76 billion three years ago, with EPS ballooning to $18.36 in per-share earnings. And with nowhere to go but up, American Airlines is expected to see revenue growth of almost 18% over the next 12 months. ", "Still, while prospects look lukewarm to promising as travel reopens, our AI sees American Airlines as a poor investment for any savvy investor, with F’s across the board in Technicals, Growth, Low Volatility Momentum, and Quality Value. ", "Apple, Inc", " \n ", " \n  ", "AAPL", " \n ", " ticked down 0.93% on Monday to $126.27, bringing YTD losses to 4.84%, with Monday closing out $4 short of the 22-day price average. ", "While the company’s stock appears to be undergoing a correction from its historically high prices, that may soon change, as Apple announced this week that it’s preparing to release several new Mac products over the coming months with M1 processing chips of their own design. The goal to phase out Intel’s processors will, hopefully, lead to longer battery life, enhanced graphics and computing cores, and increased speeds. ", "Apple had a banner 2020, with revenue growth topping 18.5% to $274.5 billion, a nearly $10 billion increase over the last three years. Forward 12-month revenue growth is tapped at 1.4%. ", "Operating income ballooned by 34% over the last 12 months, outpacing 25% growth in the last three years to end 2020 on a high of $66.3 billion. However, this still falls short of the company’s $70.9 million operating income three years ago. ", "At the same time, per-share earnings jumped 35.6% in the last fiscal year to $3.28 in per-share earnings, a 49.3% increase over $2.98 per-share earnings three years ago. And ROE expanded from 49.4% to 73.7% over the past 36 months. Currently, Apple is trading with a forward 12-month P/E of 24.25x. ", "As an investor, it’s usually a bad call to bet ", "against ", "Apple, and that holds especially true on the heels of a pandemic. Our AI agrees that Apple is a sound investment at the moment, rating the company A in Growth, B in Low Volatility Momentum and Quality Value, and C in Technicals. ", "Poor, poor GameStop ", " \n  ", " \n   ", "GME", " \n  ", ". ", "GameStop is trending once again this week as reports of short sellers circulated widely on Monday, sparking talk that traders may be about to push the stock up again to keep the latest round of short-betting hedge funds from squeezing profits out of GameStop’s surely inevitable decline. And in fact, traders have lost over $930 million in meme stock short positions in the last five trading days alone – with no end in sight. ", "The stock closed up 12.9% for the day, ending at $180.60 per share with a final trade volume of 7.46 million. The stock has started climbing again in the past week, with shares up significantly from the 10-day price average of $158 and change. Currently, GameStop remains up 858% YTD. ", "Despite GameStop’s historically high stock prices, the company had an abysmal 2020. Revenue was down from $8.28 billion three years ago to $5.1 billion in the last fiscal year. Operating income declined from $320 million to $249 million in the same time frame. And per-share earnings plummeted from $6.60 to $3.31. ", "And, despite what internet traders think of GameStop’s stock, our AI sees the stock as a poor investment, with ratings of B in Growth, D’s in Low Volatility Momentum and Quality Value, and F in Technicals. ", "Long live the stonk. ", "Liked what you read? Sign up for our free Forbes AI Investor Newsletter ", "here", " to get AI driven investing ideas weekly. For a limited time, subscribers can join an exclusive slack group to get these ideas before markets open."], "clicks": 892},
{"headline": "Saving Investors From Meme Stocks: GameStop (GME)", "date": "Apr 13, 2021,", "company": "gamestop", "blog_id": "blogAndPostId/blog/post/25-60759bddd6276f0006a4e1e5", "paragraphs": ["“I don’t know what the f— I’m doing, I just know I’m making money,”", "Danny Tran in this ", "TikTok video", ", also featured in The Wall Street Journal’s ", "It’s All Just a Game to Me", ".", "As more investors willfully admit they are gambling on stocks, I feel compelled to offer an easy way to make more informed decisions, and, hopefully, save people lots of money. Over the next few weeks, I’m going to give investors research that shows when meme stocks’ valuations get crazy, and they should sell. This week, I focus on GameStop \n ", " \n  ", "GME", " \n ", " and put it in the Danger Zone.", "Why Investors Need Independent Research", "Wall Street isn’t in the business of warning investors of the dangers in risky stocks because they make too much money from their trading volume and underwriting of debt and equity sales.", "Only independent firms are free to provide unconflicted research and navigate ", "Wall Street conflicts", " and ", "analyst biases", ". With ", "new technology", " to cut through the deluge of data in financial filings and overcome the flaws in Wall Street research, self-directed investors are better positioned than ever to make informed decisions.", "What’s the Problem Here?", "The meme stock frenzy highlights the lack of reliable fundamental research, which creates a vacuum for mis-information that elevates sources like Reddit to undue levels of influence and leads investors to lose perspective.", "Without reliable fundamental research, investors have no way of gauging whether a stock is expensive or cheap. Without a reliable measure of valuation, investors have little choice but to gamble if they want to own stocks. The lack of reliable fundamental research is a big problem if we want the market to have integrity and not unfairly advantage those with better information.", "Figure 1: Mis-Information for Self-Directed Investors Is At an All-Time High", "Meme Stock #1: GameStop: Danger Zone Anywhere Above $45/share", "GME was not worth owning anywhere above $45/share, given the company’s fundamentals, as explained when I closed my Focus List: Long position in the stock in late January. Nevertheless, the stock went on to climb as high as $347/share before taking a roller coaster path back to ~$185/share. See Figure 2.", "Figure 2: Fundamental Research to Know When to Sell GME", "To give readers a sense of just how crazy overvalued the stock was at its peak, I do the math and show how the business would have to perform to justify $347/share.", "“Crazy” at $347 Explained: Implies More Revenue Than Macy’s", " \n ", " \n  ", "M", " \n ", "My ", "reverse discounted cash flow (DCF) model", " is an excellent research tool to analyze the expectations implied by stock prices. To justify $347/share, it shows that GameStop must:", "In this ", "scenario", ", GameStop earns nearly $21 billion in revenue in 2030 or more than the trailing-twelve-months (TTM) revenue of Macy’s (M), ", "AutoZone", " \n ", " \n  ", "AZO", " \n ", ", and Chewy \n ", " \n  ", "CHWY", " \n ", " . See Figure 3 for details.", "Figure 3: GameStop’s Historical Revenue vs. DCF Implied Revenue: Scenario 1", "For reference, GameStop’s revenue fell by 3% compounded annually from 2009 to 2019.", "Still Crazy: At $185", "For perspective on the current price, I run the same analysis to show what the company must do to justify $185/share:", "In this ", "scenario", ", GameStop earns over $11 billion in revenue in 2027, which is 19% higher than GameStop’s record revenue of $9.6 billion in 2012 and the TTM revenue of Nordstrom \n ", " \n  ", "JWN", " \n ", ", Advance Auto Parts \n ", " \n  ", "AAP", " \n ", ", and Chewy. See Figure 4 for details.", "Figure 4: GameStop’s Historical Revenue vs. DCF Implied Revenue: Scenario 2", "More Reliable Fundamental Research on other Meme Stocks", "With a better grasp on fundamentals[1], investors have a better sense of when to buy and sell – and – know how much risk they take when they own a stock at certain levels.", "In the coming weeks, I will perform this same analysis on other meme stocks: AMC Entertainment (AMC), Blackberry (BB), Express Inc. \n ", " \n  ", "EXPR", " \n ", ", Genius Brand \n ", " \n  ", "GNUS", " \n ", "s (GNUS), Koss Corporation (KOSS), Naked Brands Group (NAKD), and Nokia (NOK). Each of these stocks were on Robinhood’s ", "restricted stocks list", " and each saw a major rise and fall in late January.", "I will also feature other meme stocks that trade at levels entirely disconnected from fundamental reality, such as Netflix \n ", " \n  ", "NFLX", " \n ", " and Tesla \n ", " \n  ", "TSLA", " \n ", ".", "Figure 5: Meme Stocks Disconnected From Fundamental Reality", "Disclosure: David Trainer, Kyle Guske II, and Matt Shuler receive no compensation to write about any specific stock, style, or theme.", "[1] Only Core Earnings enable investors to overcome the inaccuracies, omissions and biases in legacy fundamental data and research, as proven in ", "Core Earnings: New Data & Evidence", ", a forthcoming paper in The Journal of Financial Economics written by professors at Harvard Business School (HBS) & MIT Sloan."], "clicks": 5790},
{"headline": "14 Critical Lessons Investors Can Learn From The GameStop Story", "date": "Apr 20, 2021,", "company": "gamestop", "blog_id": "blogAndPostId/blog/post/4409-607727c93e873000068b0c3d", "paragraphs": ["Investing in the stock market comes with risks, especially in the age of social media. Valuable information that every investor should be aware of—including the occasional volatility of the stock market as well as investment nuances such as short selling—came into the spotlight recently when Redditors banded together to inflate the prices of retailer GameStop’s (GME) stock.", "As well as serving as a refresher on stock market basics, the GameStop situation is also a signpost pointing to emerging trends in investment and fintech. Current and would-be stock market investors can take away some important lessons from this story. Below, 14 members of", " Forbes Finance Council", " share what every investor should learn from the GameStop stock saga.", "1. Micro-communities can have an outsize influence.", "Micro-communities and micro-topics will continue to have outsize market influence that’s driven by natural or synthetic social media magnification. This phenomenon is going to accelerate and be more evident as investors pour into entirely digital asset classes. -", " Ravi Balasubramanian", ",", " Sandbox Banking", "2. Trading is a zero-sum game.", "The GME story brings to mind one of the adages from Peter Lynch: “Avoid hot stocks in hot industries.” While investing based on fundamental changes within a company can make money, trading is a zero-sum game. When a stock becomes hot, speculative and irrational factors will significantly affect the stock price, making it difficult to make a profit. -", " Lijie Zhu", ",", " Dragon Gate Investment Partners", "3. Don’t just follow the herd.", "Herd investing can only get you into trouble. It might work once or twice, but when you eventually get burned, that burn will offset all of your prior gains. Invest in fundamentals and solid intuition, not in fickle social movements. -", " Oliver Sabga", ",", " Term Finance", "4. The stock market can be manipulated.", "The GME story shared an important lesson with us all: At times, the stock market can be manipulated. What Reddit’s “wallstreetbets_” group showed us all was how easily the market can be manipulated. Long-term investors know the market is volatile and invest with caution for obvious long-term growth. New and young investors have taught us what it means to gamble on the stock exchange. -", " Natasha Velez", ",", " H2 IT Solutions, Inc.", "5. Market manipulation can come from multiple places.", "Market manipulation can occur both inside and outside of Wall Street. Influence can come from traditional media, social media and other areas. Be cautious and keep it simple. Invest in what you can understand. -", " Matt Scott", ",", " 7xCapital.com", "6. Regulation needs to be revisited.", "As the Spiderman saga has taught us, “With great power comes great responsibility.” This applies now to retail investors. Sudden moves in the stock market used to be driven by hedge funds, but with the fintech “revolution,” things are different. With the Gamestop/Reddit-Robinhood moment, we all saw that a short-selling squeeze can come from retail investors. A new way to think about regulation is urgently needed. -", " Arcady Lapiro", ",", " Agora", "7. You have to consider time and opportunity costs.", "Financial decisions—especially investments—all have fundamental variables of time and opportunity cost. The GameStop situation is no different. Although the underlying economics did not follow traditional investment logic, the market makers did not factor in the intrinsic value of the retail investors’ time during a pandemic. Speculation is healthy for the economy, but any high-risk investment needs balance. -", " John Tytko", ",", " Caremerge, Inc.", "Forbes Finance Council", " is an invitation-only organization for executives in successful accounting, financial planning and wealth management firms. ", "Do I qualify?", "8. Don’t look at investing as a ‘thrill ride.’", "The stock market is not a casino. Investing one’s hard-earned money should be done in a thoughtful and disciplined way. You can get the thrill of a roller coaster ride by going to a theme park; try to avoid mimicking that thrill by riding the wave of a hot stock. Remember, you are investing to build a nest egg for the long-term future, and losing this can be painful. -", " Sonya Thadhani Mughal", ",", " Bailard, Inc.", "9. Don’t buy or hold stock as a ‘fan.’", "The GameStop/Reddit short-selling story piqued the interest of many non-investors—especially younger generations. Regardless of the public’s interest, ultimately those businesses need to be profitable to maintain such a high degree of demand. That doesn’t appear to be a factor that’s in GameStop’s favor over the last few years. Don’t hold the stock as a fan; keep it as long as it remains a profitable investment. -", " Jeffrey Bartel", ",", " Hamptons Group, LLC", "10. Keep your emotions out of investing.", "Don’t let your emotions rule your investing decisions. Even recently I have seen reports of people taking out loans to buy GameStop at its highest point for the day. As investors, we have to stay prudent with our investments. You never want to be the one who buys high, sells low and repeats until you’re broke. Unless you’re in the front end of such a windfall, be wary of it. -", " Justin Goodbread", ",", " Heritage Investors", "11. Only take bigger risks with money you’re willing to lose.", "If you are planning on shorting stocks and playing the high-risk portions of the market, do so with caution. This should be your “Vegas” money—in other words, the money you are willing to lose. It’s okay to take risks and chase some unicorns; just make sure it’s with money you can afford to lose. -", " Joseph Orseno", ",", " Tiltify", "12. Don’t just react—research.", "“", "Get rich quick” should never be a strategy. Remember the flip side: Potential huge gains are potential huge losses. Do your research. Know your risks and be comfortable with what you could lose. Be knowledgeable, not reactionary. -", " Lori Moes", ", ", "DJM Design CAD & Coordination Services Inc.", "13. Beware the power of groupthink.", "This was less a David-versus-Goliath story than a lesson on the power of groupthink. Though many investors made life-changing amounts of money, many others found themselves without a chair when the music stopped. As boring as it may seem, understanding the fundamentals wins the day, not groupthink—especially when it’s driven by social media. -", " Catherine York Powers", ",", " Constant AI", "14. Use online investment platforms with caution.", "The GameStop upheaval highlighted the shortcomings of investing platforms that encourage excessive trading, such as Robinhood. One important lesson is that these systems are not always designed with the users’ best interests in mind. They encourage frequent trading, yet most successful investing is boring and requires patience. Research shows increased trading activity can negatively affect returns. -", " Marthin De Beer", ",", " BrightPlan"], "clicks": 2463},
{"headline": "GameStop Should Sell Stock ASAP", "date": "Mar 30, 2021,", "company": "gamestop", "blog_id": "blogAndPostId/blog/post/2464-60624e410dc4620006a85950", "paragraphs": ["GameStop \n ", " \n  ", "GME", " \n ", " shares have held up extremely well after its earnings announcement a week ago given that the company didn’t take any questions on the conference call and announced in its ", "10-K filing that it may sell shares", ". ", "After falling from $181.75, the close before the announcement, to $120.34 the next day, it immediately rallied the following day to $183.75 erasing all its losses (even after dropping to $116.90). And while it was very volatile on the third day, trading between $163.26 and $218.93, it closed at $181. ", "With the stock up 862% to $181.30 this year from $18.84, the elevated stock price provides management the opportunity to raise a significant amount of cash with very little dilution. It makes perfect sense for the company to sell shares.", "$146.7 million in debt coming due this year", "GameStop had $146.7 million debt coming due this year as of January 30 but paid off essentially half of it, $73.2 million, on March 15 using cash on hand. It had $508 million un-restricted cash on January 30.", "Of the remaining $73.5 million, $48.6 million is owed to its French subsidiary, Micromania SAS, where it pays 0% interest. This debt can be extended until 2025 but the interest rate could increase. The remaining $25 million is revolving credit expiring in November 2022.", "Long-term debt interest rate is 10%", "When a company is not doing well it can wind up paying a much higher interest rate than a healthy company. The bulk of GameStop’s long-term debt consists of $216.4 million, 10% interest rate notes coming due in March 2023, just two years away. By paying this off early, as long as there aren’t any large pre-payment penalties, the company could save $21.6 million in interest costs or almost $0.31 in EPS. Note that GameStop paid $34 million in interest cost last year.", "Selling stock may hardly create much dilution", "GameStop’s shares are up 862% year-to-date with them at $181.30. If the company wanted to raise enough money to pay off the $216.4 million of debt costing it 10% per year and not worry about having to refinance it, the dilution would hardly be noticed. Assuming the company would have to discount the shares to sell them, it would take the following number of shares and the resulting dilution.", "Selling shares could put pressure on the stock. If it were to fall a significant amount the dilution would still not be dramatic.", "If the company wanted to raise $100 million in additional cash this is the number of shares it would have to sell and the dilution.", "Because the valuation numbers don’t make sense", "Before Covid-19 derailed the U.S. and worldwide economies GameStop was slowly losing revenue from fiscal 2016 to 2018 then had a sharp drop-off in fiscal 2019 (ended in January 2020). GameStop may be able to shake up its business enough to recover at least some of downturn but it won’t happen overnight.", "Note that while GameStop’s fiscal year ended on January 30, 2021, and would normally be labeled fiscal 2021, GameStop calls it fiscal 2020.", "When calculating the company’s valuation metrics these results use fiscal 2018’s $8.3 billion in revenue so as to be as generous as possible.", "Due to the huge spike in GameStop’s shares and the resulting bubble valuation metrics, it makes perfect sense for the company to sell shares and put itself on stronger financial footing."], "clicks": 30552},
{"headline": "GameStop’s $1 Billion Insurance Policy", "date": "Apr 5, 2021,", "company": "gamestop", "blog_id": "blogAndPostId/blog/post/2464-606b4395581d4e000691fe6d", "paragraphs": ["On December 8 last year GameStop filed a ", "prospectus with the SEC", " describing an “Open Market Sale Agreement” where it could sell up to $100 million of stock “at the market” which is essentially in the flow of normal trading activity. The stock’s close before the filing on December 7 was $16.35.", "With the stock now trading more than 10 times the close on December 7 (it did fall initially this morning to a low of $164.81 but has recovered to around $183) the company ", "updated the filing this morning", " so that it could now sell up to $1 billion in stock but no more than 3.5 million shares. This is a move that makes perfect sense as o", "utlined in my article from early last week", " and the company wrote about in its ", "10-K filing on March 23", ".", "These numbers show why it makes sense", "During December last year GameStop’s stock essentially traded between $13 and $21. It closed the year at $18.84 with a market cap of $1.28 billion. ", "At last Thursday’s close (the market was closed on Friday) the stock was at $191.45 with a market cap of $13 billion, just over 10 times more than the end of last year even though nothing has materially changed in the business.", "The company had $147 million in debt coming due this year and had paid off essentially half of it, $73.2 million, on March 15 using cash on hand. It had $508 million in un-restricted cash on January 30.", "Of the remaining $73.5 million of debt, $48.6 million is owed to its French subsidiary, Micromania SAS, where it pays 0% interest. This debt can be extended until 2025 but the interest rate could increase. The remaining $25 million is revolving credit expiring in November 2022.", "It also has $216.4 million in debt coming due in March 2023, just two years away, that it is paying an interest rate of 10%. If it can pay this off early, as long as there aren’t any large pre-payment penalties, the company could save $21.6 million in interest costs or almost $0.31 in EPS. Note that GameStop paid $34 million in interest cost last year.", "Dilution impact is minimal", "The stock would have to trade just above $285 for the company to raise the maximum $1 billion on 3.5 million shares being sold, which the company views as unlikely. And even if it did the dilution impact would be minimal as GameStop has just over 70 million shares outstanding; 70,031,650 to be exact. ", "If the company wanted to raise enough money to pay off the $216.4 million of debt costing it 10% per year and not worry about having to refinance it, the dilution would hardly be noticed. Even if the shares come under pressure, but stay at $150 or higher, the dilution would be 2.1% or less.", "For each $100 million in additional cash the company wants to raise the dilution could be under 1%.", "What the money will be used for", "Typical boilerplate for the “Use of Proceeds” which is, “We intend to use the net proceeds of this offering, if any, for working capital and general corporate purposes and to further strengthen our balance sheet, which may include funding our transformation initiatives and product category expansion efforts, the repayment, refinancing, redemption or repurchase of our existing indebtedness, and capital expenditures or the satisfaction of our tax withholding obligations upon the vesting of shares of restricted stock held by our executive officers and other employees.”"], "clicks": 1277},
{"headline": "Fatal Texas Tesla Crash Becomes Locked Room Murder Mystery With New Tesla Statements", "date": "Apr 28, 2021,", "company": "tesla", "blog_id": "blogAndPostId/blog/post/6919-60899ea075380f000637c8e8", "paragraphs": ["Tesla \n ", " \n  ", "TSLA", " \n ", " provided new information on the Texas crash in the suburbs of Houston where police stated they were certain nobody was behind the wheel at the time of the crash. The crash killed two individuals, a doctor who owned the vehicle who was found in the back seat, and his friend, an investor who was found in the passenger seat.", "Earlier, I summarized ", "what we knew and didn’t know", " about the crash. Monday, Tesla provided new details during their earnings call. You can", " listen to the relevant section", ". Many transcripts have errors.", "Recapping: Due to the police report of nobody in the driver’s seat, there was much speculation of the role of Tesla’s Autopilot (or even FSD) function in the crash. Early on Tesla ruled out Autopilot being on, though confusion over its state and use by the driver may have played a role. The crash caused a fire which, like many battery electric vehicle fires, was complex to control. While Tesla got some data, a flash card in the car’s black box has yet to be examined by them.", "Moravy uses very confusing language in his statements. In one statement he appears to refer to the crashed car. In other statements, it could be read he’s talking about a second test car driven on the same road. There’s no clarification on this matter as yet.", "On the call, Lars Moravy, VP of Engineering, stated that:", "(Update: An earlier version of this story presumed Moravy was describing things learned about the crashed car, as he said he was reporting, and not the ambiguity over which of his statements refer to findings about the crashed car and which refer to a presumed second car used for experiments. This is now confirmed in NTSB reports.)", "The language Tesla uses is unclear. They describe the actions of ACC in the past tense, saying “ACC engaged” making it unclear if they refer to data from their car logs, or an experiment done with another car on the same road. They state only that Autosteer (Autopilot) was not engaged, and make no statement that about ACC in the crashed car. It is possible, but odd, that they would not have data on whether ACC was engaged in the same log that revealed that Autopilot was not engaged.", "Presumably that flash card will reveal more useful details, such as when belts where buckled and unbuckled, when pedals were pressed, perhaps when weight sensors or other sensors indicated movement. This Tesla model S does not feature a camera that sees the occupants the way newer models do.", "This adds weight by my earlier speculation that perhaps the driver wanted to demonstrate Autopilot, but activated only ACC, thinking that Autopilot had been activated, or activated nothing at all. Activating ACC results in a different sound and display, but obviously mistakes were made here. A foolish person might attempt to activate the system with a pole pressed to the pedal. Or activate it with the foot and then move to another seat.", "Several things still don’t add up, however:", "At this point few reasonable explanations fit the available facts, so we must await more. As before, though, there is no direct involvement of Tesla’s Autopilot function with this accident, other than the ways in which its existence may have prompted the owner of the car to act recklessly. One such way would be to attempt to show off Autopilot but instead engage only the ACC. Normally in that situation it’s pretty clear this has happened. It’s not unusual in driving a Tesla to attempt to turn on Autopilot and have it fail and issue a warning because the street, like this one, is not accepted by the system as suitable. Drivers are told to keep hands on the wheel, and if you get this warning, your would normally just keep driving. ", "We don’t know for sure who was driving. If it was Dr. Varner, the owner of the car found dead in the back seat, he would have been familiar with engaging both ACC and Autopilot and what to do. If it was his guest, Mr. Talbot, he might not have been familiar. We might speculate that Mr. Tablot could possibly have crashed the car and, due to fire on the driver’s side, moved to the passenger seat to escape but did not get further. Moving to the rear seat would not be impossible, but a challenge for an injured person. More data is needed to consider these questions.", "If ACC had no involvement (which one would imagine Tesla should have data on, and if not, it will be extracted soon from the car’s internal logs) it’s still confusing how the people ended up in the two seats they were in, and why the investigators were so certain they did not move. With no ACC, this could be explained as somebody simply trying out the car’s Ludicrous acceleration mode on a short street and driving into a tree, with odd motions after the crash.", "This leaves us with:", "The biggest issue before the public, however, is if advanced driving features like the Telsa’s are to blame for the accident, and if their design should be changed to prevent this. It’s very hard to figure out how to design systems to be impenetrable to deliberate attempts to override safeguards. You can make more safeguards, but they will not be perfect, and they may cause problems of their own. For example, it is reported that Tesla features will not activate if nobody is triggering the weight sensor in the driver’s seat, but they don’t deactivate if the weight goes away. You don’t want a system to disengage if the weight disappears, that would be the worst thing to do in such a situation, and you must tolerate short interruptions of the weight sensor as can come in bumps or people lifting themselves to adjust clothing. A system might perhaps move to slow down and pull off if the weight vanishes for too long and there is no input. ", "That’s quite a fancy feature for a cruise control, however. Original cruise controls were very simple, and even the advanced ones in many cars today will still do nothing about a car driving off the road into a tree if the driver ignores this. It seems most of them could also have any safety measures defeated without much trouble — though it’s important to consider most are so simple that nobody would be motivated to try. A false belief that the system will handle all problems might motivate people to defeat safety measures. This is the paradox of quality: The better you make a system, more more likely it is it might be abused, and we feel motivated to punish a system with extra requirements for the sin of being better.", "Tesla could make use of the inward facing camera present in newer models. Such use raises many privacy concerns, and is further complicated by the fact that AI computer vision techniques have reliability and computing cost issues. For many, it’s a move from technology that serves the owner to technology that constrains them. No one answer is clear.", "Read/leave comments here"], "clicks": 4105},
{"headline": "GameStop Reportedly Looking For A New CEO", "date": "Apr 12, 2021,", "company": "gamestop", "blog_id": "blogAndPostId/blog/post/7172-6074ba0bccd4f3000686ff28", "paragraphs": [], "clicks": 2608},
{"headline": "NTSB Preliminary Report On Texas Tesla Crash Adds These Few Details", "date": "May 10, 2021,", "company": "tesla", "blog_id": "blogAndPostId/blog/post/6919-6099861a9a46a8000626e158", "paragraphs": ["There has been much speculation over the April 17 fatal crash of a Tesla \n ", " \n  ", "TSLA", " \n ", " Model S in suburban Houston, triggered by the fact that the people in the car were found in the back and passenger seats, and ", "investigators insisted", " nobody was in the driver’s seat at the time of the crash. As anticipated, Tesla’s Autopilot technology apparently ", "played no role", " in the crash, in spite of reports and suggestions it did.", "Today, the NTSB released its ", "preliminary report", " on the crash. Salient facts include:", "Most of this was known or suspected or revealed by Tesla, which also originally stated its logs showed Autopilot was not engaged.", "One main new piece of data is that Dr. Varner, the owner, was driving when the car started down the road. The distance is too short to likely have allowed a move into the back seat before the crash.", "The puzzle still remains over how Dr. Varner got into the back seat after this crash, which damaged the battery case and started a fire which eventually consumed the whole car. There is no report on the condition of the driver’s door and whether it would have been impossible to exit this way, which might prompt him to crawl, mortally injured, into the back seat where he either died or could not get out.", "(Tesla’s investor call last week used confusing language which led several outlets to believe Tesla had stated that Adaptive Cruise Control was engaged in this accident. The NTSB description of tests on scene clarifies this ambiguity, to make it clear that experiments with a test car showed ACC ", "can", " engage on the road segment in question, with no information on whether it was engaged. Tesla’s statements indicated that if it were engaged, it would only reach 30mph on this road segment.)", "It also rules out a third person being the driver of the car and fleeing. So while the above scenario seems unlikely, and the crash investigators stated they were certain it was false, it seems the only remaining explanation.", "As expected — and insisted by Tesla at the start — this crash was fairly mundane, and it’s what happened after the crash to place Dr. Varner in the back seat that is a puzzle. It’s possible that the driver was conducting a demo of the Tesla’s “Ludicrous” mode which produces extremely high acceleration — this is a very common thing for Tesla owners to demonstrate to their friends, though usually not on quiet cul-de-sacs with 30mph speed limits. If this was such a demo, gone wrong, it would explain the violence of the crash.", "Another likely target of the investigation will be the fire, as we are still learning more about EV fires. Statistics show EV fires are moderately less common than fires in gasoline vehicles, but they have special characteristics, including taking longer to bring to a complete close, as was the case here.", "Read/leave comments here"], "clicks": 1628},
{"headline": "Why the Tesla Crypto Scandal May Have Proven That ESG Is Just Social Credit For Corporates", "date": "May 13, 2021,", "company": "tesla", "blog_id": "blogAndPostId/blog/post/6148-609ccf37a31900000611c73a", "paragraphs": ["So Elon has just backtracked on his commitment to allow Teslas to be purchased with Bitcoin citing the woeful environmental record of the cyptocurrency. This has pacified environmentalists who have been outraged that the car company most recognised as an innovator towards our zero-emission future, was supporting a technology that is estimated to already be the cause of 1% of global electricity consumption (much of which from coal sources). In response to the news, the crypto-cult cite that even at 1% electricity consumption, this is still less than the world’s financial system with the Bankers in their prime real-estate air-conditioned offices.", "While the battle for the moral high-ground continues, what this saga proves is that ESG is fast becoming the equivalent of a social credit scheme for corporates.", "Environmental, Societal and corporate Governance (ESG) is a management discipline that is fast becoming a bubble within the financial markets. It is the direct descendent of Corporate Social Responsibility (CSR) initiatives which still flourish across the corporate community, but with the fundamental difference of being tied directly into the organisation’s strategic obectives and with the Business Intelligence (BI) discipline of reporting and disclosures from the company’s operational systems. As ESG reporting and disclosure requirements are becoming mandatory in the EU and other jurisdictions, CEOs and Investor Relations professionals are falling over themselves to ensure they are reporting on the right metrics and those reports have the right ‘optics’.", "Such reports and disclosures are bolstered by surveys and other insights that are compiled by research and ratings agencies, aggregated and sold to asset and hedge fund managers who use the information to inform their trading strategies and portfolio constructions and ultimately therefore which stocks and bonds we all invest in through our 401k and equivalent pension plans.", "Some ESG ratings and research companies also look at social media and news coverage of the companies they evaluate in order to ascertain whether the sentiment concerning an organisation’s animal welfare, human rights, or environmental credentials are up to scratch. In such a way, social media acts as a barometer of public opinion towards an organisation, and thereby enables finance professionals to get early warning of trouble on the horizon.", "A loose shorthand for ESG therefore is to think of it as an ‘ethics’ score for an organisation, but the central weakness of ESG is the question of ", "whose", " ethics we are judging corporations on?", "In this way, ESG can be thought of as the western version of social credit for corporates. Social Credit systems are much maligned in the west, as they are often seen as an Orwellian attempt by the Chinese authorities to control their populace. While reports of their sophistication and efficacy are grossly overplayed in the popular news, the system is an alluring glimpse into a future where automation and AI might create an abundance of goods and services and therefore what remains scarce might need to be allocated in an alternative manner to the monetary system we know today.", "With social credit, the value of money is eroded. Let’s use an example. There will only ever be a limited number of high-rise apartments that face sunrise in Shanghai. If the ability to rent such an apartment is limited to only those with a very high social credit score, then the cost becomes a secondary factor. This creates a dynamic where more wealthy but less virtuous citizens are limited in choice to the lower floors that face the cold north. Similarly with first-class rail tickets (the Chinese have a vastly superior rail network to the US, and so railways are their airways). There are only ever so many comfortable seats at the front of the train. If access to these carriages are allocated on merit not wealth, then money becomes a secondary consideration - and the pursuit of wealth perhaps a less appealing goal.", "To be sure, it doesn’t take much imagination to see the dystopian effects of such a system. How your social credit score is created is something of a black-box (much as the case with ESG), and rumours that it can be effected by certain innocuous behaviours are likely to create the type of self-sensorship that we in the west find so abhorant to our value of personal freedom. That said, given the absence in the west of a viable alternative to money when automation passes the tipping point, social credit stacks up as an alternative to UBI schemes as a means of allocating scarce resources on merit rather than capital.", "The flaw with social credit, just as with mainstream-ESG is the tendancy towards a unilateral standard. The poor correlation of ESG-scores from different providers is seen as a bug in the system that needs to be fixed. As ESG data starts to cast judgment on the activities and behaviours of corporates (as it has with Tesla most recently), we are in danger of conflating the ethical assessment of a small few on a company as the universal ethical assessment for us all.", "Elon’s decision to backtrack on the acceptance of crypto as payment seems motivated by this flaw in ESG. As pressure to downgrade Tesla has mounted, so the spectre of more expensive capital has become a likely prospect to face. The crypto markets are still too volatile to be a credible capital market alternative - and so faced with the choice, ESG or crypto - ESG has (for now) been the victor. The plethora of alt-coins in the market has however taught us one thing - personalisation is a quality valued highly around the world. If ESG can bend to being more personalised, then perhaps there can still be an opportunity for visionaries like Elon to pursue an unconventional strategy, and not be so badly penalised for doing so.", "My prediction? This battle will play out for a long time to come..."], "clicks": 2385},
{"headline": "‘I Won’t Sell’ Dogecoin—Tesla Billionaire Elon Musk Reveals Where He Stands In ‘The True Battle’ Between The Dollar And Crypto", "date": "May 23, 2021,", "company": "tesla", "blog_id": "blogAndPostId/blog/post/5660-60aa33317725680007d50d7b", "paragraphs": ["Elon Musk, the meme-loving Tesla \n ", " \n  ", "TSLA", " \n ", " chief executive that ", "moves markets with his irreverent tweets", ", is apparently readying for war.", "Musk, ", "who's recently gone all-in on the somewhat satirical cryptocurrency dogecoin", "—helping its price soar many thousands of percent to ", "a mind-blowing $42 billion market capitalization", "—sees a \"battle\" coming between government-backed fiat currencies and protocol-based cryptocurrencies.", "\"The true battle is between fiat and crypto,\" Musk, who also runs the rocket company SpaceX, said this weekend via his preferred platform, ", "Twitter", ". \"On balance, I support the latter.\"", "Musk, who has said he plans to put a \"literal dogecoin on the literal moon\" with the SpaceX \"DOGE-1 mission to the moon\" early next year, ", "has sent bitcoin and cryptocurrency prices on a roller coaster this year", ".", "\"I haven’t and won’t sell any [dogecoin],\" Musk ", "tweeted", " this week in response to an investing influencer's claim Musk \"has a large doge holding.\"", "In February, Musk sent bitcoin sharply higher when he announced ", "Tesla had bought $1.5 billion worth of the cryptocurrency", ", boosting it still further when the company said ", "it would accept bitcoin as payment", ". SpaceX has meanwhile ", "said", " it will accept the meme-based dogecoin.", "\"This mission will demonstrate the application of cryptocurrency beyond Earth orbit and set the foundation for interplanetary commerce,\" said SpaceX vice president of commercial sales Tom Ochinero. ", "However, Musk ", "was partly blamed for a bitcoin and crypto crash this month", " following his criticism of bitcoin's energy use—leading Tesla to suspend bitcoin payments until bitcoin \"transitions to more sustainable energy.\"", "Musk appears to have had his prior interest in crypto galvanized by coronavirus pandemic-induced government spending over the last year, with many economists increasingly concerned over soaring inflation and rock-bottom interest rates.", "\"When fiat currency has negative real interest, only a fool wouldn’t look elsewhere,\" Musk said via ", "Twitter", " back in February, adding: \"bitcoin is almost as BS as fiat money. The key word is 'almost'.\"", "The U.S. Federal Reserve, along with many other of the world's major central banks, has gone on a spending spree over the last year in an attempt to offset the economic damage wrought by lockdowns and the pandemic, leaving many investors fearful their dollars will be devalued by the huge increase in the supply of money. ", "\"The onset of huge stimulus packages in response to the pandemic will continue to expose fiat currencies as dangerously inflation-prone and unstable—and with interest rates at rock bottom, there is little to be done to stop inflation continuing to rise,\" Jai Bifulco, the chief commercial officer at precious metals investor Kinesis, said via email. ", "\"It is only a matter of time before the changing sentiment toward fiat currencies will bring to reality a world in which they move out of the mainstream.\""], "clicks": 1181130},
{"headline": "Rising Gas Prices Influence Decision To Buy An Electric Car, Tesla Ranks High: Survey", "date": "May 16, 2021,", "company": "tesla", "blog_id": "blogAndPostId/blog/post/3525-60a17b47a906840006de02a4", "paragraphs": ["Rising gas prices are a clear factor when deciding to buy an EV, a survey says. ", "While the ", "restart of Colonial Pipeline operations", " is a positive development and should push down the price of gas, the average price hit 3.02 this past week – the highest average since October 2014, ", "according to the AAA", ".", "And this won’t be the last time gas prices spike for some unforeseen reason. ", "A March 2021 survey showed that as gas prices rise, the percentage of those who would consider an EV rises too.", "“Rising gas prices would be especially influential to those on the fence who ‘possibly’ would own an EV in the next decade,” according to the ", "CarGurus Electric Vehicle Sentiment Survey United States", " (PDF).", "In the survey, the question was posed: ", "“", "If prices for gasoline increased, at what price ($ per gallon) would you be much more likely to consider buying an electric vehicle?”", "—At 4$ per gallon, 26% percent would be much more likely to consider buying an EV. ", "—This jumps to 57% at $5 per gallon. And goes up from there.", "Brand matters too — with Tesla the clear winner. ", "“Tesla continues to be the most trusted brand to develop EVs (and that lead has grown),” CarGurus said. ", "“But nearly 80% of those interested in EVs say they’re open to several brands when it comes time to buy,” according to the survey.", "Comments can be sent via direct message to “twitter.com/mbrookec”"], "clicks": 1096},
{"headline": "Tesla Will Stop Accepting Bitcoin As Payment Due To Environmental Worries, Musk Says", "date": "May 12, 2021,", "company": "tesla", "blog_id": "blogAndPostId/blog/post/50769-609c580f8fc737000637a808", "paragraphs": [], "clicks": 46566},
{"headline": "Tesla Found Guilty Of Throttling Battery Life, Charging Speed In Norway", "date": "May 24, 2021,", "company": "tesla", "blog_id": "blogAndPostId/blog/post/7398-60abe2783f6c9f000665641f", "paragraphs": [" Tesla could be forced to pay out as much as $160 million to Norwegian Tesla owners after a Norway court ruled a 2019 software update throttled the electric cars’ battery life and slowed the charging speed.", "Norway is home to one of the largest markets for electric vehicles, in part thanks to ", "aggressive tax exemptions", " for electric cars. In January, the country became the first in the world where the sale of electric cars ", "outnumbered", " those with engines that run on gasoline. In 2020, 54.3% of all new cars sold ran on electric batteries. Norwegian officials say the country is on track to meet its goal to end the sale of", " gasoline and diesel powered vehicles", " by 2025.", "Similar lawsuits accusing Tesla of issuing software updates that slashed battery capacity have been filed elsewhere. A class action lawsuit was filed in 2019 in a Northern California court in which plaintiffs claimed an update decreased earlier car models’ range by as much as 40 miles. According to the complaint, Tesla “fraudulently manipulated its software with the intent ", "to avoid ... legal obligations", " to customers to fix, repair, or replace the batteries” of the cars. In response, Tesla said in a statement to ", "Electrek", " the software updates were intended to help “protect the battery and improve battery longevity,” and that only ", "a small fraction of owners", " “have noticed a small reduction in range when charging.” The same year, the National Highway Traffic Safety Administration ", "began an investigation", " into Tesla car batteries’ alleged defects that remains open. ", "Tesla is found guilty of throttling charging speed, asked to pay $16,000 to thousands of owners", " (Electrek)"], "clicks": 1536},
{"headline": "Volkswagen Group Doubles Tesla’s Rolling 12-Month European EV Sales", "date": "May 24, 2021,", "company": "tesla", "blog_id": "blogAndPostId/blog/post/4988-60ab91187e7a0b0006b2d4e8", "paragraphs": ["Data to be released this week will reveal that the Volkswagen Group hasn’t just overtakeb Tesla \n ", " \n  ", "TSLA", " \n ", " for the Number One slot in European battery electric vehicle (EV) sales, but has already streaked away.", "Schmidt Automotive Research ", "data shows the Volkswagen Group has more than doubled Tesla’s sales in rolling 12-month EV sales in Europe and its lead continues to grow.", "Europe’s rolling 12-month EV sales grew to 856,000 from May 2020 to April 2021, and the Volkswagen Group claimed 206,400 of them.", "Tesla, meanwhile, slipped down to fifth with 102,500 sales as the Renault/Nissan alliance, Hyundai/Kia and Stellantis eased past the once-undisputed EV leader.", "To be fair to Tesla, it still sells only three models in Europe (the Model S, the Model X and the Model 3), and its controversial Tesla Grünheide factory in Germany shows few signs of opening any time soon.", "The Volkswagen Group’s fleet of EVs seems to grow weekly, ranging from the e-Golf and e-Up to the ID.3 and ID.4, just from the Volkswagen brand. Skoda has the Enyaq SUV EV, Seat has the Cupra Born, Porsche has the Taycan and Audi has the e-tron, e-tron Coupe and the e-tron GT.", "But Tesla hasn’t just been swamped by the Volkswagen Group, even though the mainstream OEMs have struggled with chip shortages and Covid-19 lockdowns.", "The Renault/Nissan alliance, which was the long-time European EV leader before Tesla, rolled past the American company with 137,500 sales.", "Hyundai/Kia posted 112,800 sales and Stellantis claimed 105,700. While Stellantis has 14 brands, only four of them (Peugeot, Citroen, DS and Fiat) offer electric vehicles.", "So successful has the Volkswagen Group been so far this year that every fourth EV sold in Europe in 2021 has been one of theirs; either a Seat, a Skoda, a Volkswagen, an Audi or a Porsche.", "It owns 24.5% of Europe’s EV sales from January to April this year, followed by Stellantis (17.1%), Renault/Nissan (12.5%) and Tesla (11.9%), with Hyundai/Kia (11.7%) nipping at Tesla’s heels."], "clicks": 2508},
{"headline": "Rising Gas Prices Driving You To An Electric Car? Cost To Charge A Tesla Model 3 Vs Gas", "date": "May 22, 2021,", "company": "tesla", "blog_id": "blogAndPostId/blog/post/3525-60a415d2deeff6000683ed72", "paragraphs": ["You will save money on “fuel” costs with an electric car. That’s certain. But how much?", "Let’s start with the basics. A ", "report from Kelly Blue Book", " said this: ", "“If you put 1,000 miles on your vehicle each month, for example, and pay 10 cents for each kilowatt-hour of electricity, this pegs your at-home EV recharging bill at $25 to $33 dollars* per month (based on the calculation of 3-4 driving miles equaling one kilowatt-hour).”", "And the report added that even if you double the rate to 20 cents per/kWh, your monthly EV recharging cost will still be comparatively cheap at be $50 to $66 dollars.", "Compare that to a gas car that gets a combined average of 30 miles per gallon. If you’re theoretically driving 1,000 miles per month, you’ll likely spend between $70 and $100 (", "see this calculator", ") depending on the price of gas — with trends this summer on the high end of that range. ", "Tesla Model 3: ", "Let’s take a Model 3 with a range of 322 miles.", "There are long discussions on how exactly to calculate the cost of charging a Model 3. Calculations vary but here’s one calculation (Autopilot Review) using California as an example: ", "“Let’s say you live in California and your average cost per kWh is $0.20. Then filling up a Model 3 or Model Y Long Range with a 75 kWh battery pack from 10 kWh to 70 kWh (you usually don’t fill up to 100% as that degrades the battery more quickly), would cost $12.00 (60 kWh x $0.20/kWh).”", "Compared to a gas car like the Honda Accord, the annual ‘”fuel” costs as calculated by the U.S. Department of Energy based on 45% highway, 55% city driving, 15,000 annual miles and current fuel prices are as follows:", "2020 Tesla Model 3 Long-Range", " — annual fuel cost of $500", "2020 Honda Accord", " — annual fuel cost of $1,450", "The DOE’s numbers are estimates. Needless to say, there are a lot of variables for EVs, which include: ", "But the bottom line is, you will save money. Since switching to an electric car, in addition to saving hundreds of dollars per year on fuel costs, I’m also saving on things like maintenance. My EVs have been almost maintenance-free — with the exception of things like tire rotation.", "——", "Notes:", "In Los Angeles, before I converted to an EV in 2013, I was paying closer to $150 a month for gas for roughly 1,000 miles. Now, if I charge exclusively at home, I typically pay no more than $50 a month, based on my calculations.", "*To calculate your kilowatt-hour rate, divide the total of power bill by your total power consumption (minus any taxes). “For example, if your total monthly power bill is $327, your electricity taxes are $27, and your monthly power consumption is 2,500 kWh, your power cost is $0.12 per kWh,” according to NEC Co-op.", "Comments or suggestions can be sent to me via a direct twitter message at twitter.com/mbrookec."], "clicks": 15095},
{"headline": "Tesla’s Bitcoin Holdings In Reverse", "date": "May 23, 2021,", "company": "tesla", "blog_id": "blogAndPostId/blog/post/2464-60aaa4c04d8d8c00064aa912", "paragraphs": ["Bitcoin has continued its deep dive this weekend, falling from a high of $42,172 on Friday and hovering around $32,000 to $33,000 on Sunday afternoon. At one point it had fallen over 50% from its April 14 all-time high of $63,863.", "As of March 31 Tesla \n ", " \n  ", "TSLA", " \n ", " owned $2.48 billion worth of bitcoin with a carrying value or cost of $1.33 billion. Based on a price of $58,919 on March 31, the company owned 42,902 bitcoins. ", "Elon Musk has tweeted that Tesla had not sold any bitcoin, at least ", "as of May 16", ", and before on ", "May 12 he tweeted", " that the company had not sold any and that it was intending to use it for transactions.", "However, Tesla’s bitcoins have fallen over $1 billion", "After peaking in mid-April the value of Tesla’s bitcoins have fallen over $1 billion in value since March 31. At a price of $32,500 it brings the company’s bitcoin value down to $1.37 billion. This makes Tesla’s bitcoins only worth $38 million more than what it paid and the cryptocurrency only needs to drop by 3% to $31,600 to go into the red.", "While a decrease of this magnitude has almost no impact to the company’s finances, as it had over $17 billion in cash at the end of March and a market cap of $559 billion, it does bring into question whether Tesla should be holding bitcoin and potentially other cryptocurrencies due to their volatility. ", "While Musk has reiterated multiple times that the company won’t be selling its bitcoins, it would not be out of character for him to change his mind. And bitcoin hodlers may not find out about a course correction until after the fact. "], "clicks": 16297},
{"headline": "How Green Is Tesla, Really?", "date": "May 13, 2021,", "company": "tesla", "blog_id": "blogAndPostId/blog/post/51030-609d52178fc7370006611023", "paragraphs": ["On May 13, Elon Musk said Tesla would no longer accept bitcoin because of bitcoin’s heavy energy consumption. Yet the company ranks well behind General Motors and Ford in reporting carbon emissions and setting carbon-reduction targets. So how green is Tesla, really? ", "Those concerned with the fate of the planet have long lauded Tesla for its efforts ", "“To accelerate the world’s transition to sustainable energy.”", " The company says that “", "the faster the world stops relying on fossil fuels and moves towards a zero-emission future, the better.", "” ", "While founder and CEO Elon Musk caused alarm among environmentalists in early 2021 by endorsing bitcoin, whose annual carbon emissions are ", "equivalent to that of a small country", ", he reversed this position with a ", "tweet", " on May 13. Responding in part to ", "a tweet from", " the Cambridge Centre for Alternative Finance calling bitcoin’s energy usage “insane,” Musk said that Tesla would no longer transact in bitcoin because of its heavy reliance on fossil fuels and its “great cost to the environment.” ", "There is no denying that Tesla has disrupted the auto industry by making exclusively electric vehicles—and maybe more importantly, by making them sexy. When the Model 3 was released in 2017, corporate elites and tree-huggers alike put their names on the wait list. Tesla succeeded in electric cars where its American competitors, General Motors and Ford, had failed. ", "But Tesla’s story about being green is not as black-and-white as it may seem.", "A recent study conducted by Arabesque (not publicly available) found that the car company is among the 15% of the world’s largest companies, across 14 indices, that do not disclose their overall greenhouse-gas emissions. General Motors and Ford, meanwhile, are far more transparent—about both the emissions they create in making their vehicles and their targets for reducing those emissions. ", "One needs to ask: If Tesla is truly committed to a positive environmental future, why doesn’t it disclose its carbon emissions? ", "Arabesque is an asset-management company that uses ESG (environmental, social and governance) and sustainability criteria in allocating capital. It argues that ESG policies signal the strength of a company’s strategy, corporate purpose, and management qualities. ", "In terms of carbon emissions, Arabesque expects corporations to report two pieces of data: ", "The data must also be from a reporting period within the past two years in order to be considered sufficiently timely. ", "Arabesque believes that disclosing these specific data and targets allows company executives  to be held accountable by shareholders and climate activists, as well as  raising awareness among company employees and prompting them to actively seek ways to reduce carbon. ", "When I asked Arabesque researchers which companies stood out among those that did not report their carbon emissions, they replied, “Tesla.” ", "Surprised? I was too.", "Arabesque ranked Tesla well behind Ford and General Motors (GM)—two of Tesla’s fiercest American competitors, which have built their success on carbon-intensive combustion engines. ", "Tesla shows its carbon emissions in graphs, which means they do not disclose the exact numbers.  As well, they do not offer details, such as Scope 1 or Scope 2 emissions, or the percentage of operations that these graphs cover. What’s more, the company’s data are not timely: the figures in its 2019 report are for 2017. ", "The company also has failed to commit to carbon targets, making its decision to trade cars for the energy-intensive bitcoin an understandable oversight. ", "GM and Ford, on the other hand, are willing to air their dirty laundry. Not only do both companies disclose their carbon emissions, they have also set ambitious targets to get to net-zero carbon. ", "General Motors uses ", "science-based targets", " and plans to be ", "carbon-neutral in products and operations by 2040", ". It will offer only electric vehicles by 2035. To get there, the company is investing an additional $27 billion in autonomous and electric-vehicle research and development, over and above what it invests in gas and diesel vehicles. ", "Ford also uses science-based targets and plans to be carbon-neutral by 2050. Further, it offers very specific targets for its ", "Scope 3 emissions", " (the emissions related to its products, such as their cars). It too also plans to invest heavily in electrification: $22 billion through to 2025. ", "Staying silent on its carbon emissions helps Tesla dodge public scrutiny of lapses in its ESG. ", "In 2018, for example, the company ", "was fined $139,500 by the Bay Area Quality Management District ", "because of malfunctioning burners at its Fremont plant that had emitted high levels of nitrogen oxide between 2013 and 2016. As well, t", "he Environmental Protection Agency", " is currently investigating Tesla for failing “to provide records demonstrating compliance with certain requirements under the applicable National Emission Standards for Hazardous Air Pollutants under the Clean Air Act of 1963, as amended, relating to Surface Coating of Automobiles and Light-Duty Trucks regulations.” ", "Granted, even though Tesla does not disclose the specifics of its carbon emissions, it has disrupted the auto sector’s reliance on combustion engines. And the company is seeking not to just move a single part of the transportation industry, but the entire transportation and energy ecosystem. ", "For example, Tesla provides both businesses and homeowners an opportunity to generate solar energy through ", "solar panels", " and store them in a ", "Powerwall battery", ". Tesla also claims to be seeking to extend its battery life and ensure they are recycled responsibly. Remarkably, it has also ", "opened up its patents", "—a bold move in an industry that works hard to protect its intellectual capital in order to capitalize on research-and-development investments. ", "Despite all these positive—even revolutionary—moves, Tesla’s lack of transparency regarding its carbon emissions and targets should raise questions about its commitment to a sustainable future. As much as we all love a good story of the maverick that disrupts the way we do things, we need to take a long breath before we say that Tesla is deep green. If Tesla is truly committed to low carbon emissions, it should, at the very least, be willing to report them. If it had done so, maybe it wouldn’t have committed to using bitcoin in the first place."], "clicks": 2504},
{"headline": "3 Ways Tesla Creates A Personalized Customer Experience", "date": "May 10, 2021,", "company": "tesla", "blog_id": "blogAndPostId/blog/post/3541-608fef875502290006abeb61", "paragraphs": ["Before we dive into what makes Tesla’s products and services so unique, let’s level set on the fact that the leader at its helm is not like other leaders. This past weekend Elon Musk hosted Saturday Night Live, in the monologue calling himself the first host to have Asperger’s (and he publicly admitted it). Musk is a PR mastermind, because if there was ever a way to get the world to pay attention, this episode of SNL did it.", "The richest man in the world just made a joke on live television he wouldn’t be making eye contact with the cast because of Asperger’s. What makes him a genius is his willingness to try new things and be vulnerable—his self-deprecating humor. Did the world expect him to just (in his own words) be “a chill and normal dude” while also totally changing how humans live on this planet and perhaps where we would live next? He’s not like everyone else—he’s different. That makes him create incredible products. So let’s get to why Tesla products are so unique. ", "In the competitive car industry, Tesla stands on top. The company has the ", "highest customer satisfaction", " rate of any car manufacturer. Tesla customers tend to be incredibly loyal, and ", "91% of customers", " plan to buy or lease another Tesla for their next car. Customers are so fanatic about the brand that they are often willing to wait years for the next model. ", "What is it about Tesla that has created such an engaged and loyal fanbase? Part of it is the sleek design, innovative features and eco-friendly nature. But it’s also because of the personalized experience. Tesla is completely dedicated to its customers and treats each person as an individual.  ", "I’m the proud owner of a Tesla and finally understand the hype. I don’t ever see myself buy any other kind of car. Everything from the design to the customer experience is built to create an innovative driving experience. ", "Here are three ways Tesla does personalization well. ", "1 . Personalized Driver Profiles", "The hallmark of Tesla’s personalization efforts is its ", "driver profiles", ". Each driver can change their settings with the single push of a button. Instead of having to manually adjust things like the wheel and mirror location, Tesla makes the changes automatically based on who is driving. Other manufacturers may change the seat location setting based on which key is used to open the car door, but Tesla driver profiles go beyond typical car personalization to adjust things like suspension, braking, lights, radio presets and even driving style to match each user.  ", "Users switch between profiles on Tesla’s touchscreen, which means the profile isn’t attached to a single key. Driver profiles are seamlessly integrated into the Tesla experience, which makes the car an extension of the driver and allows each person to drive the car in the way they want and that is most comfortable to them. ", "Many cars feature tablets on them—but they don’t work—the cars are not smart. Half the time they can’t find your phone. Connecting your bluetooth is nothing short of a nightmare. Tesla’s user experience just destroys the competition. ", "2 . Data-Driven Design", "Tesla leads the industry in integrated data, largely from its test fleet of fully self-driving cars. Each car picks up movements from numerous sensors, which it then connects to create a full picture of the driving experience. That data helps create a powerful navigation system and strengthens Tesla’s self-driving technology, but it also provides valuable insights on customers. ", "Tesla has an incredibly strong understanding of who its customers are—both as a whole and individually. By understanding each customer, what they are looking for in a driving experience and why they chose Tesla, the company can tailor the experience and change how the car drives to best meet their needs. A busy professional with a long commute will have different needs and therefore a different driving experience than a mom driving her kids around town. By staying in tune with data, Tesla can regularly update its offerings, finetune its software and build experiences and features that resonate with each user. ", "3 . Dynamic Personalization", "Unlike many other car companies, Tesla aims to create a fluid system that can be updated as systems improve. Most other cars include dashboards with physical buttons that never change, Tesla has a", " fully upgradable dash", ". That means that as the software improves over time, the entire driver experience can also evolve and improve.  ", "The fluid dashboard and internal software open the door to dynamic personalization, which is the next wave of innovative personalization. Tesla has a patent to use the existing interior-facing cameras in its Model 3 to recognize occupants and automatically apply personalized settings. The dynamic personalization approach takes it a step further than the current driver profiles by sensing who is in the car and making the necessary adjustments for an automatically personalized experience. ", "Tesla CEO and visionary ", "Elon Musk", " put it this way: “You’ll probably want dynamic personalization, so it’s like you step into the car, it knows who you are, it knows everything you want, and the car reconfigures itself automatically to all your preferences. So you could step into any car, and that’s how it would be.” ", "Tesla hasn’t officially launched dynamic personalization yet, but the framework is in place for it to be functioning soon. Just like many other aspects of car manufacturing, Tesla again leads the charge with innovative personalization. ", "Tesla isn’t just the fastest growing car company, it’s ", "the fastest growing company", " in the world. And at the root of its growth and innovation is personalization. Tesla demonstrates that forward-thinking companies must focus on personalization and that doing so and creating a unique customer experience can lead to incredible loyalty and growth.", "Blake Morgan", " is a customer experience futurist, keynote speaker and the author of the bestselling book ", "The Customer Of The Future", ". Sign up for her weekly newsletter ", "here", "."], "clicks": 3675},
{"headline": "Fiery Tesla Crash In Houston Didn’t Involve Autopilot, Investigators Say", "date": "May 10, 2021,", "company": "tesla", "blog_id": "blogAndPostId/blog/post/7398-6099999afbac9f0006e78e46", "paragraphs": [], "clicks": 2877},
{"headline": "Tesla And Facebook Among Today’s Growth Stocks With F Scores", "date": "May 24, 2021,", "company": "tesla", "blog_id": "blogAndPostId/blog/post/50076-60abd47657a2810006f09d8d", "paragraphs": ["Every week, Q.ai releases a “thematic screen” covering stocks that share commonalities – a common theme, if you will. But today’s thematic screen is a little…different. Instead of sharing our AI’s insights on top-rated consumer or momentum opportunities, we’re going to reveal which big-name growth stocks have earned a big, fat F. ", "Let the stock shaming begin.", "Q.ai", " runs daily factor models to get the most up-to-date reading on stocks and ETFs.", " Our deep-learning algorithms use Artificial Intelligence (AI) technology to provide an in-depth, intelligence-based look at a company – so you don’t have to do the digging yourself. ", "Sign up for the free Forbes AI Investor newsletter ", "here", " to join an exclusive AI investing community and get premium investing ideas before markets open.", "Advanced Micro Devices ", " \n  ", " \n   ", "AMD", " \n  ", " ", "closed down 1.14% Friday to $77.17 per share, ending the day with 40.2 million trades on the books. Despite the ongoing global chip shortage, soaring sales, and recent announcement of a $4 billion share repurchase program, AMD is down 15.85%, marking a sharp decline from January’s all-time highs. ", "Still, AMD’s last year proved quite fruitful on the balance sheet, as fiscal 2020 saw the company rake in a 17% increase in revenue to $9.76 billion. Operating income experienced 36.5% growth in the same period, ending the year at $1.37 billion – over 314.4% growth from $451 million three years ago. This overall rise in profits saw per-share earnings grow from $0.32 to $2.06 in the last three years for total growth of 644.3%. ", "All told, AMD’s ROE grew from 36.2% three years ago to 57.5% in the last fiscal year. Currently, the company is trading with a forward 12-month P/E of 35.71x and is expected to see revenue growth of 1.56% over the next year. ", "AMD’s stock prices may be declining now – but such downtrends provide the perfect opportunity for investors to hop on in anticipation of future gains. That said, Advanced Micro Devices is rated by our AI as A in Technicals, Low Volatility Momentum, and Quality Value, with a big, fat F in Growth. ", "Tesla, Inc ", " \n  ", " \n   ", "TSLA", " \n  ", " ", "closed down just over 1% on Friday, ending the day with 26 million trades at a final price of $580.88 per share. This is a stark drop from the electric auto maker’s 22-day price average of $646.44 per share. Tesla is down 17.7% YTD.", "Tesla’s sudden decline after a year of accelerated growth is likely due to the company’s Bitcoin gambit, which seemingly has done the opposite of pay off. Whereas CEO Elon Musk just weeks ago claimed that consumers would be able to use Bitcoin to pay for Tesla’s products, now the company has backed down from that position, which played a part in Bitcoin’s most recent decline from almost $60k to just over $35k. No doubt this put a dent in Tesla’s Bitcoin holdings – not to mention their stock prices. ", "But Tesla’s 2020 numbers show the company in a much better light, with revenue up 14% to $31.5 billion and operating income growing 10.76% to $1.95 billion. This saw Tesla’s EPS balloon almost 56% in the last year to $0.64, though per-share earnings are still down from $1.14 three years ago. ", "And while the company itself is projected to experience 9% growth over the next 12 months, Tesla is trading at almost 114 times earnings, suggesting stock that is grossly overvalued for its current position. ", "Still, our AI sees Tesla as a potential holding for some portfolios – though its growth leaves much to be desired. All told, Tesla is rated A in Technicals, Low Volatility Momentum, and Quality Value, and F in Growth. ", "Lowe’s Companies, Inc. closed down 0.5% Friday to $192.47 per share, ending the day $5 lower than the 10-day average with 4 million trades on the books. The home improvement retailer is up almost 20% YTD after a banner 2020 saw prices reach new all-time highs month for the bulk of the pandemic. ", "Last week held nothing but good news for Lowe’s’ balance sheet, as the company turned in Q1 earnings that beat Wall Street analysts across the board. Sales alone were up 24% as consumers continue to invest in their homes, with the momentum carrying forward into May. ", "Additionally, Lowe’s raised its sales forecast for the year, noting that it’s already ahead on its prior sales forecast of $86 billion for fiscal 2021. However, record-high prices and worries about labor shortages saw Lowe’s continue to close down – which may soon present an opportune buying opportunity for investors who missed the 2020 buy-in trough. ", "Lowe’s, the famous rival of Home Depot \n ", " \n  ", "HD", " \n ", ", has boomed in the last year, with revenue growth of 5.3% to $89.6 billion. At the same time, operating income grew 11.5% throughout the 2020 fiscal year, and 144.4% in the last three, bringing the company from $4.97 billion to almost $10.9 billion. ", "These astronomical earnings have seen per-share earnings skyrocket nearly 223% in the last 36 months to $7.75 in the 2020 fiscal year. At the same time, ROE has leapt from 48.6% to over 342%. Currently, Lowe’s is trading with a forward 12-month P/E of 17.85x. ", "At the end of the day, Lowe’s proved in the last year that it has the potential to deliver solid performance for its shareholders – though all-time stock price highs leave little wiggle room for future expansion. As such, the home improvement company rates A in Technicals, Low Volatility Momentum, and Quality Value, and F in Growth.", "Molson Coors Beverage Company ended Friday at $57.15 per share, trading up 1.17% for the day and 26.5% for the year. Although the famous beverage company has suffered in its stock chart since mid-2016, the pandemic gave the company a chance to rebound (after a significant loss, of course), bringing Coors to its highest stock price since 2019. And as the economy reopens one piece at a time, the summertime rush is expected to yield a fresh surge in product consumption. ", "However, Molson Coors did not experience such a great year on its balance sheet. While operating income grew 14.65% to $1.36 billion in the last fiscal year, it hasn’t yet recovered to its $1.46 billion operating income three years ago. At the same time, revenue slipped from $10.77 billion to $9.65 billion over the last 36 months, with EPS down from $5.15 to $4.38 in the same period. ", "But there is light at the end of the tunnel: Coors is expected to grow 2.3% over the next 12 months, and the company is currently trading with forward earnings of 13.75x. ", "All told, Molson Coors rates highly across (most of) the board, with an A in Technicals, Low Volatility Momentum, and Quality Value…and F in Growth. ", "Facebook, Inc \n ", " \n  ", "FB", " \n ", " traded 13.6 million shares on Friday, ticking down 0.75% through the day to a final price of $316.23. The company is up 15.77% YTD. ", "Facebook trended in the news last week as the company still struggles with its January ban of Donald Trump. While Facebook passed the buck to its oversight board to make a ruling, the oversight board kicked the buck right back, stating that it “declines Facebook’s request and insists that Facebook apply and justify a defined penalty.” ", "Additionally, Facebook announced early in the week that it plans to implement two new revenue streams. The first provides a method to monetize online high school and minor league sports games via a pay-per-view model. The second, “Live Shopping Fridays,” will allow Facebook users to purchase product from leading vanity brands. ", "But it’s not like Facebook needs new streams of revenue – anytime soon, at least. The company raked in a 9.8% increase in revenue last year and 69% in the last three, bringing total revenue from $55.8 billion to nearly $86 billion in a very short time frame. Additionally, operating income ballooned 53% in the last three fiscal years to $32.67 billion, while per-share earnings are up 54% in the same period to $10.09. ", "Despite all this expansion, Facebook is still expected to experience 3.7% revenue growth over the next 12 months. Currently, the social media giant is trading at forward 12-month earnings of 24.19x. ", "But while our AI rates Facebook mostly positively with A’s in Technicals, Low Volatility Momentum, and Quality Value, it, too, earns a big, fat F in Growth.", "Liked what you read? Sign up for our free Forbes AI Investor Newsletter ", "here", " to get AI driven investing ideas weekly. For a limited time, subscribers can join an exclusive slack group to get these ideas before markets open."], "clicks": 1371},
{"headline": "With The Low-Cost $35,000 Tesla Model 3 Gone, Price Creeps Up", "date": "May 23, 2021,", "company": "tesla", "blog_id": "blogAndPostId/blog/post/3525-60a83fda3f6c9f0006f03535", "paragraphs": ["Tesla hiked the price of the least-expensive Model 3 underscoring the fact that the $35,000 variant is history. ", "Price creep:", " ", "Model 3 Standard Range Plus up $3,000 since February:", "The T", "esla Model 3 Performance (AWD) also saw a price hike", " (via Electrek), it’s now $55,990 up from $54,990.", "What happened to the much hyped $35K Model 3?", "In 2019, Tesla was actively promoting the $35,000 Model 3 — as was the media.", "“We are incredibly excited to announce that the standard Model 3, with 220 miles of range, a top speed of 130 mph and 0-60 mph acceleration of 5.6 seconds is now available at $35,000!” — ", "Tesla press release,", " ", "February 2019", "But that got watered* down, ", "as reports indicate at the time", ". And by November of last year ", "it was no longer a viable variant", " when the base Model 3 became the Standard Range Plus (now with 263 miles of range).", "While there were some small price decreases for the the Standard Range Plus in February and March, prices have been creeping up ever since. ", "Those multiple incremental price increases cumulatively add up to a decent price hike.", "Though Tesla has been mum on the Model 3 price hikes, CEO Elon Musk in February did say in a Tweet why the Standard Range Model Y was eliminated. “I don’t think the range...meets the Tesla standard of excellence,” he said.", "A low-range Model 3 may also be unacceptable to Tesla. ", "Tesla is also reportedly developing a $25,000 car that would presumably have lower range than its more expensive cars — but that’s likely not a factor because that car isn’t due until 2023, according to estimates. ", "*Tesla sold a software locked version of the $38,000 Model 3 Standard Range, which was sold by special order with a $3,000 discount.", "Comments or suggestions can be sent to me via a direct twitter message at twitter.com/mbrookec"], "clicks": 2622},
{"headline": "Recent Correction An Opportunity To Buy Tesla Stock?", "date": "May 18, 2021,", "company": "tesla", "blog_id": "blogAndPostId/blog/post/25-60a34b0e2f91430006468fbc", "paragraphs": ["Tesla stock", " (NASDAQ: TSLA) declined by almost 12% over the last week (five trading days), compared to the S&P 500 which remained roughly flat over the same period. There were a couple of trends impacting the stock including weaker than expected sales in China in April and the company’s decision to stop accepting Bitcoin as a mode of payment for the purchase of its vehicles. Moreover, the broader sell-off in technology and high-growth stocks over the last week also likely impacted Tesla. So will Tesla stock continue to decline over the coming weeks and months, or is a recovery looking more likely? According to the Trefis Machine Learning Engine, which identifies trends in a company’s stock price data for the last ten years, TSLA stock has a solid 69% chance of a rise over the next month after declining by about 12% in the last five trading days. See our analysis ", "Tesla Stock Chances Of Rise", " for more details.", "So is Tesla stock a buy for long-term investors? Although Tesla stock has corrected by -20% year-to-date and remains down by about 33% from its all-time highs, we think it is still pricey, trading at over 130x consensus 2021 earnings. While the company should see strong growth ahead, Tesla’s guidance of 50% annual growth in deliveries over a multi-year horizon looks aggressive, given the increasing competition from not just mainstream automakers, but also new entrants into the EV space. Moreover, there are concerns regarding the company’s business in China, which has come under scrutiny from regulators amid local reports of quality and safety issues. Tesla is counting heavily on the country to drive growth (sales in China more than doubled last year). In April, Tesla’s wholesale sales of its made-in-China vehicle declined 27% in April versus March to about 26k units, while over half the sales were related to exports, leading to questions surrounding domestic demand. Tesla’s relative lack of profitability from its core automotive business is also a concern. Although the company posted a net profit for Q1, it was driven largely by sales of regulatory credits, without which Tesla would have been in the red.", "[4/15/21] Will Tesla Stock Rally Further?", "Tesla stock", " (NASDAQ: TSLA) rallied by almost 17% over the last week, driven by a broader recovery in technology stocks and a bullish outlook from multiple brokerages. Moreover, the company also raised prices on select models including its entry-level Model 3 Standard Range Plus ($500 price increase) and its top-end Model S Plaid Plus ($10k increase), likely signaling that it is more confident about demand going forward. So will Tesla stock continue its upward trajectory over the coming weeks and months, or is a correction looking more likely? According to the Trefis Machine Learning Engine, which identifies trends in a company’s stock price data for the last ten years, TSLA stock has a 71% chance of a rise over the next month after rising by about 17% in the last five trading days. The expected one-week return for the stock is 7.6%. See our analysis ", "Tesla Stock Chances Of Rise", " for more details.", "Although Tesla stock still looks pricey, trading at over 160x consensus 2021 earnings, it still remains about 20% below its recent highs. We think there are a couple of tailwinds for the stock in the medium term. Firstly, the regulatory environment for electric vehicles should become more conducive. With the Covid-19 stimulus bill now signed into law, Democratic lawmakers who control the House and the Senate (albeit by a slim margin) are likely to focus on climate-related issues - a key component of President Biden’s agenda, potentially benefiting EV players. Tesla’s delivery growth is also likely to soar this year, driven by market share gains in China and plans to expand production further with new plants slated to open in Texas and Berlin this year.", "[3/9/2021] Should you Buy Tesla Stock After The Recent Correction", "Tesla stock", " (NASDAQ: TSLA) has declined by about -22% over the last five trading days and remains down by close to -34% over the past month. Although there hasn’t been much news specific to the company, growth stocks, in general, are being impacted by rising bond yields and fears of higher inflation. Stocks are valued based on discounted future cash flows, and through the ultra-low interest rate environment following Covid-19, investors likely cared less about whether profits were available today or out in the future. This benefited growth stocks such as Tesla, which rallied by about 8x in 2020. However, with Covid-19 cases on the decline and vaccines being rolled out, investors are more optimistic about the economic recovery, pushing up bond yields. The 10-year U.S. Treasury rate has jumped from about 1.1% to about 1.6% in just about a month and this is likely causing investors to re-allocate funds to more cyclical and value stocks.", "So is Tesla stock poised to fall further or could it see a recovery? Per our machine learning model, which analyzes five years of stock price data, Tesla stock has a strong chance of a rise over the next month after declining by -22% over the last five days. See our analysis ", "Tesla Stock Chances of Rise", " for more details. Now, what’s the outlook like for Tesla in the longer term? Although the stock still looks pricey, trading at about 135x consensus 2021 earnings, Tesla could quickly grow into this valuation if it executes well. During its most recent earnings call, Tesla said that it expects to grow deliveries at a CAGR of 50% a year over a multi-year horizon, meaning that it could possibly be selling almost 40x the number of vehicles it currently does by 2030 if it sustains such a growth rate. While a lot of things need to fall into place for Tesla to grow to these numbers, the company has shown that it is capable of quickly expanding manufacturing capacity, with its Shanghai plant going online in record time, and its factories in Texas and Berlin commencing production sometime this year. (related:", " ", "Tesla Upside: How Tesla Gets To A $10 Trillion Market Cap", ")", "[3/2/2021] Will Tesla Stock Rebound After 17% Drop?", "Tesla stock", " (NASDAQ: TSLA) has declined by around 17% over the last month and currently trades at $675 per share. There are a couple of factors driving the sell-off. With the Covid-19 vaccine rollout gathering steam and with U.S. Covid-19 cases on the decline, investors are likely betting on a swifter economic recovery, moving money away from technology and high-growth stocks to more cyclical and value stocks. Moreover, the tech sector saw a sharp sell-off last week following an increase in bond yields. Tesla stock has been particularly badly hit, considering that it has surged by over 8x from its March 2020 lows, and trades at a rich valuation of about 160x consensus 2021 earnings. So will Tesla stock continue its downward trajectory over the coming weeks and months, or is a rally looking more likely?", "According to the Trefis Machine Learning Engine, which identifies trends in a company’s stock price data for the last ten years, returns for Tesla stock ", "average close to 17%", " in the ", "next month (21 trading days)", " period after experiencing a -17% decline over the last 21 trading days. The stock is also likely to ", "outperform", " the S&P 500 over the next month, with an expected return that would be ", "13%", " higher compared to the S&P 500.", "But how would these numbers change if you are interested in holding TSLA stock for a shorter or a longer time period? You can test the answer and many other combinations on the Trefis ", "Machine Learning to test TSLA stock chances of a rise after a fall and vice-versa", ". You can test the chance of recovery over different time intervals of a quarter, month, or even just one day!", "MACHINE LEARNING ENGINE – try it yourself:", "IF", " TSLA stock moved by -5% over five trading days, ", "THEN", " over the next 21 trading days, TSLA stock moves an average of 4.9%, which implies a return that is about 3% ahead of the S&P 500.", "More importantly, there is a 57% probability of a ", "positive return", " over the next 21 trading days and a 52% probability of a ", "positive excess return", " after a -5% change over five trading days.", "Some Fun Scenarios, FAQs & Making Sense of TSLA Stock Movements:", "Question 1: Is the average return for Tesla stock higher after a drop?", "Answer:", "Consider two situations,", "Case 1: Tesla stock drops by -5% or more in a week", "Case 2: Tesla stock rises by 5% or more in a week", "Is the average return for Tesla stock higher over the subsequent month after Case 1 or Case 2?", "TSLA stock ", "fares better after Case 2", ", with an average return of 4.9% over the next month (21 trading days) under Case 1 (where the stock has just suffered a 5% loss over the previous week), versus, an average return of 8.8% for Case 2.", "In comparison, the S&P 500 has an average return of 3.1% over the next 21 trading days under Case 1, and an average return of just 0.5% for Case 2 as detailed in our dashboard that details the ", "average return for the S&P 500 after a fall or rise", ".", "Try the Trefis machine learning engine above to see for yourself how Tesla stock is likely to behave after any specific gain or loss over a period.", "Question 2: Does patience pay?", "Answer:", "If you buy and hold Tesla stock, the expectation is over time the near-term fluctuations will cancel out, and the long-term positive trend will favor you - at least if the company is otherwise strong.", "Overall, according to data and Trefis machine learning engine’s calculations, patience absolutely pays for most stocks!", "For TSLA stock, the returns over the next N days after a -5% change over the last five trading days is detailed in the table below, along with the returns for the S&P500:", " ", "Question 3: What about the average return after a rise if you wait for a while?", "Answer:", "The average return after a rise is understandably lower than a fall as detailed in the previous question. Interestingly, though, if a stock has gained over the last few days, you would do better to avoid short-term bets for most stocks - although TSLA stock appears to be an exception to this general observation.", "TSLA’s returns over the next N days after a 5% change over the last five trading days is detailed in the table below, along with the returns for the S&P 500:", "It’s pretty powerful to test the trend for yourself for Tesla stock by changing the inputs in the charts above.", "While Tesla stock may have declined, 2020 has created many pricing discontinuities which can offer attractive trading opportunities. For example, you’ll be surprised how the stock valuation for ", "Matson vs. Intel", " shows a disconnect with their relative operational growth. You can find many such ", "discontinuous pairs here", ".", "See all ", "Trefis Price Estimates", " and ", "Download ", "Trefis Data", " here", "What’s behind Trefis? See How It’s Powering New Collaboration and What-Ifs For ", "CFOs and Finance Teams", " | ", "Product, R&D, and Marketing Teams"], "clicks": 5120},
{"headline": "Bitcoin, Tesla, Lumber:  Bubbles Bursting?", "date": "May 18, 2021,", "company": "tesla", "blog_id": "blogAndPostId/blog/post/4002-60a4460f9a4b180006b2ab82", "paragraphs": ["We talked about the closing of the bitcoin and gold performance gap yesterday.", "Bitcoin has been up as much as 134% on the year. Meanwhile, gold, the historically favored inflation hedge still remains down on the year—even as inflation is running as hot as we've seen in many years. It hasn't made sense. And now this dynamic is correcting.", "The air is coming out of bitcoin—and money is moving into gold.", "Is this the bursting of a bubble? And if so, are there other bubbles in danger of bursting in this world of \"free\" money? Maybe.", "Let's take a look at a few charts that would suggest things can get much uglier, at least in some specific cases...", "First, for reference: In China, back in 2014-2015, a record ", "surge in margin debt", " (fueled by the Chinese government) led to a bubble in the Chinese stock market. From June 2014 to June 2015 (just one year), the Shanghai Composite rose by 160%. The bottom fell out in mid-2015 and within two months, the stock market had fallen 45%. And six years later, it remains just two-thirds of the value of the bubble peak.", "Let's take a look at what the chart of this Chinese stock market bubble looks like, compared to the current era high flyers ...", " You can see the aggressive rise in both the Shanghai and bitcoin—similar ascent angle. And the decline has already been sharp.", " On a related note (given Tesla's \n ", " \n  ", "TSLA", " \n ", " investment in bitcoin), Tesla's chart looks similar ...", "And below, we can see the meteoric rise in the price of lumber.", "As we discussed in recent Pro Perspectives notes, despite the hot housing market, lumber prices have been disconnected with reality. The supply of standing trees (called stumpage) is ", "abundant", ". The timber growers are getting no more today for a ton of stumpage than they were decades ago.", "This lumber market, like the two above, seems to have had a healthy dose of speculation. And all three are now experiencing sharp declines. And the declines tend to get more and more slippery as speculators try to squeeze through the exit door at the same time.", "Get my ", "Little Black Book of Billionaires Secrets here", "."], "clicks": 2889},
{"headline": "If You Thought GameStop’s Valuation Was Crazy, Check Out Hometown International", "date": "Apr 26, 2021,", "company": "gamestop", "blog_id": "blogAndPostId/blog/post/2464-6086d4c0715aca0006693a18", "paragraphs": ["The Wall Street Journal ", "published an article on Friday, April 16", ", during trading hours that a company named Hometown International had a market cap of $100 million but only $35,000 in revenue for 2019 and 2020 combined. While the stock dropped that day from $13.50 to close at $12.99, it has recovered half of its loss to hover around $13.23.", "While the single deli in New Jersey has been around since October 2015 its stock only became public on January 5 this year. And until the Journal article ran it had never traded more than 1,800 shares in a day out of 7.8 million. It also only traded 42,800 shares on the day the article ran. ", "GameStop \n  ", " \n   ", "GME", " \n  ", " looks like a deep value play compared to Hometown", "To understand how ridiculous Hometown’s valuation compares to recent high-flyer GameStop the best measurement is market cap to revenue. Before Covid-19 derailed the U.S. and worldwide economies GameStop was slowly losing revenue from fiscal 2016 to 2018 then had a sharp drop-off in fiscal 2019 (ended in January 2020). ", "Note that while GameStop’s latest fiscal year ended on January 30, 2021, and would normally be labeled fiscal 2021, GameStop calls it fiscal 2020. When calculating the company’s market cap to revenue valuation metric this result uses fiscal 2019’s $6.5 billion in revenue to remove any Covid-19 impacts.", "GameStop’s valuation is also elevated when compared to its market cap to revenue ratio of 0.15x at the end of 2020 before the Reddit crowd spiked its share price.", "Hometown’s stock is wildly overvalued", "Hometown’s peak revenue year was 2016 when it generated $76,213. It fell in each of the next three years to $21,772 in 2019 before Covid-19 forced it to shut down for part of 2020 when its sales were $13,976. For those investors used to reading thousands, millions or billions after revenue numbers, these are the actual revenue results for Hometown.", "Using a market cap of $103 million and 2019’s revenue to calculate a market cap to revenue ratio at Friday’s share price of $13.24 it is over 4,700x. This is for a company that is losing money, is a single deli and has never generated over $100,000 in revenue. ", "The Journal pointed out that hedge-fund manager David Einhorn of Greenlight Capital wrote about Hometown in a recent investor letter with his comments revolving around the, “wild speculation in the markets.” It is easy to agree that Hometown has a crazy valuation, and it is even higher when its warrants are included.", "Hometown’s market cap is really $2 billion", "The company awarded shareholders 20 warrants for each share of stock in April last year. This created 156 million warrants with exercise prices ranging from $1.25 to $2.00. While the warrants would bring in $253 million in cash, they are currently exercisable and would balloon Hometown’s share count to 163.7 million. ", "At the current share price of $13.23 this morning its market cap would be almost $2.2 billion, and its market cap to revenue ratio would go to a stratospheric 99,500x.", "Hometown vs. Chipotle", "One can also compare Hometown to another restaurant stock. The Wall Street Journal uses Chipotle, which is probably a good one to use since deli chains such as Subway, Arby’s, Jimmy John’s and Jersey Mike’s are private companies.", "Chipotle has a market cap of about $42.5 billion and had revenue of just under $6 billion in 2020. It market cap to revenue ration is essentially 7x. When compared to Hometown’s 4,700x or 99,500x it solidifies Hometown’s extreme valuation.", "Other considerations an investor should take into account per its recent 10-K", "The company wrote ", "in its 10-K", " that its, “", "Future success is highly dependent on the ability of management to locate and attract a suitable acquisition.” ", "If it can use its overvalued shares to find a company willing to accept them, then maybe the valuation multiple will move down to a more wildly overvalued position."], "clicks": 3258},
{"headline": "Here’s Why GameStop Excitement Is Surging Again On Reddit", "date": "May 16, 2021,", "company": "gamestop", "blog_id": "blogAndPostId/blog/post/50462-60a16b2b7f2e9c0006800eb2", "paragraphs": ["Enthusiasm for GameStop’s stock is again surging among Redditors, with the topic dominating the site’s most popular posts over the past week, as a slew of supportive tweets from the company buoyed persisting belief the stock will soon skyrocket in the short squeeze many investors maintain didn’t come to fruition amid the infamous trading frenzy earlier this year. ", "“Got tired of **everyone** saying “*This feels different”* But ya’ll … I’m telling you. **This feels f-cking different,” one user wrote in the forum on May 12. “GameStop officially stopped tip-toeing around online.”", "Roughly four months after Reddit investors initially hijacked the publicly traded shares of GameStop, costing the investors shorting the stock billions of dollars, the popularity of these posts reveals a persisting confidence among many that GameStop will still see the exponential increase in value they’ve predicted. The share price has fluctuated since its high of $350 in January. However, the closest it has come—in March—was still $100 less. GameStop shares saw a roughly $20 boost on Thursday and have since leveled out just below $160. ", "“The New GameStop Millionaires: Meet The Amateur Traders Who Won Investing’s Craziest Sweepstakes Ever”", " (Forbes)"], "clicks": 32509},
{"headline": "Truck you: Sunrun & Ford vs Tesla", "date": "May 20, 2021,", "company": "tesla", "blog_id": "blogAndPostId/blog/post/50796-60a6759efc098600074a7ec9", "paragraphs": ["Business development job descriptions tend to be filled with lots of buzz words and are heavy on “strategy”. Most professionals in this position overthink their roles. The fact is that the best business development partnerships are the obvious ones. These are the partnerships that are hiding in plain site. The ones that consumers and industry players both nod about and say “of course”.", "This is the case with the recently announced Ford and Sunrun \n ", " \n  ", "RUN", " \n ", " partnership. Let’s set the scene:", "The script in the automotive world is that Tesla \n ", " \n  ", "TSLA", " \n ", " has won the next generation of mobility. The Model S and Model Y are mass-market sellers and Tesla is gobbling up EV market share. Last year Tesla unveiled their “in-your-face” Cybertruck to major fanfare and immediately got half a million (non binding) pre-orders. ", "There was even a video of a Cybertruck towing a Ford F-150 to prove the Tesla’s greater torque. Everyone began writing about the demise of Ford’s market share in the truck market.", "The only problem? Ford didn't agree to the regular Teslas script and Ford is fighting back with it’s biggest asset, the F-150. This is the battle royale for transportation in North America:", "Ford stayed quiet, focused on their mobility strengths and just last night delivered a game-changing vehicle. They are delivering the Ford name and trust and form factor used by tens of millions to the market... and they are going to win. Unlike other OEM attempts at electric vehicles, Ford designed the vehicle ground-up for the new power source and is delivering a Ford truck without compromise. What will cement their winning position?", "**Enter a New Character: Sunrun**", "Tesla has the vehicle, the power wall, the solar roof... and other ancillary businesses. It would be a fools game for an incumbent automotive firm to attempt to re-architect their entire business to have the same scope. It would also be easy for a large firm like Ford to want to tackle that on-site electrification challenge. But, Ford didn’t take the bait. Ford focused on their strengths by quietly developing the mass-market EV truck and is deferring to Sunrun to be their electrification partner. ", "These Ford trucks have 300 mile range and so most people will be charging their vehicle at home. The vehicles will also integrate with the home to be a back-up power supply. How? To deliver a more complete, and higher quality solution to the Ford drives, Ford sought out Sunrun and Sunrun’s power expertise. What a smart move for both parties. Sunrun knows how to deliver consumer-level energy experiences at scale.  Ford owners will get increasingly educated about home electrification and soon be subtle targets for Sunrun solar roof systems.", "This new F-150 will put millions of EV chargers into homes. It will build resiliency into our grid. And if 5% of F-150 drivers adopt rooftop solar via Sunrun that will add another 50,000 rooftop solar homes to market each year. That partnership alone could increase rooftop solar installation in the US by 20-30%. ", "Win-Win for Ford and Sunrun. Battle on, Tesla."], "clicks": 2169},
{"headline": "Why FOMO Can Be Hazardous To Your Retirement Plan", "date": "May 19, 2021,", "company": null, "blog_id": "blogAndPostId/blog/post/1072-60a51401bb65f900063b56f2", "paragraphs": ["Bitcoin, Dogecoin, GameStop \n ", " \n  ", "GME", " \n ", ", and AMC are several on a list of those that for many have sparked dreams of early retirement and riches beyond their wildest dreams. Every day you miss out on these momentary “opportunities”, it feels like you fall another year behind your goals. The Fear of Missing Out (FOMO) can be a powerful emotion that often leads to frantic, short sighted decision making. There is no question many of the digital currency and meme stocks such as those mentioned have made some investors small fortunes. Thanks to social media those stories have been shared, favorited, and followed millions of times over which stokes the flames of an already hot investment environment. All of this to ask: if you’re feeling left out of the party, what do you do now? Let’s discuss the vulnerability of these trending investments, and hone-in on the purpose of the money you have saved.", "As of the end of April the S&P 500 was up 11.98%, a far greater growth rate than the average annual return for the market. Compare that to GameStop growing from $400 million to $22 billion in market capitalization, a gain 5,500% at its peak. Digital currencies grew from $757 billion to over $2 trillion from the start of 2021, up over 264% as a group. This explosion in value makes 11.98% feel like it would be an appropriate ", "daily", " return for your average retirement accounts. As a result, we hear more and more conversations of investments going to the moon, as if there is nothing keeping them from going up even more. You, on the other hand, should be asking at what cost and probability will social media trending investments go up, or down.", "Risk can be measured by how high an investment can go relation to how low the lows could reach. The taller the roller coaster the steeper the likely drop as a result. A ratio that measures the relation of up and down versus a typical market index is defined as Beta. If a stock has a beta of one, it means that the investment moves up and down at the same rate as the S&P 500. Bitcoin and GameStop for example have a beta more than five times the risk of the average stock. This is proven by GameStop’s recent fall from $22 billion in market capitalization to roughly $3 billion, an 87% drop in a few weeks. Bitcoin has lost 35% or more of its value several times over the last few years.", "The allure of high-risk, high-beta investing has been seen many times throughout history. Many have come and gone and the legends of them, like a good fishing story, grow. What disciplined investors have learned is that when an investment drops by half they will need to double the return to get back to even. More consistency over a longer period of time will help reach financial goals, while causing a lot less stress along the way. This is why for decades the concept of asset allocation has been a tremendous tool for the investors trying to reach their retirement goals. They have learned that controlling risk is just as important to their end results.", "Before you invest your hard earned money, define the purpose of the dollars you have, determine what return you require, and stay disciplined to that target. Of course, you can also find a financial professional you trust and collaborate with them. A prudent investor has a plan and sticks to it. If you have money to gamble outside your financial plan, do your homework and invest wisely. Just don’t let the fear of missing out disrupt your path along the way to your ultimate retirement goals."], "clicks": 241},
{"headline": "MicroVision Is The Next GameStop", "date": "Apr 29, 2021,", "company": "gamestop", "blog_id": "blogAndPostId/blog/post/2464-608a21e254fd5e0006fb46ec", "paragraphs": ["MicroVision was founded in 1993 and has pivoted its business model a number of times. Per its ", "first 10-K filing in 1998", " the company, “develops information display technologies that allow electronically generated images and information to be projected to the retina of the viewer's eye.” From its ", "most recent 2020 10-K", " the company now, “is developing a lidar sensor to be used in automotive safety and autonomous driving applications.” The company must be congratulated for staying in business so long as a public company even though it looks like it has never been profitable or at least at any significant level.", "The company did have a ", "positive product announcement", " yesterday. It was inline with a statement from Sumit Sharma, MicroVision's Chief Executive Officer, on its March quarter results of, “I expect that the A-Sample hardware and benchmarked data, for demonstration to interested parties, will be available in the April 2021 timeframe.” He added in yesterday’s press release, “I expect that a version of this lidar sensor could be available for sale, in initial quantities, in the third or fourth quarter of 2021.”", "The company also announces its March quarter results after the close today.", "From 1999 to mid-2020 its market cap only doubled with significant shareholder dilution", "From MicroVision’s first 10-K filing for 1998 the company was worth $97 million based on 6.2 million shares. Over the next 23 years its share count has increased to 157.3 million (would have been 1.3 billion shares without a 1 for 8 stock split in 2012) with a market cap of $208 million.", "Note that these share counts (usually around the end of February or early March of the following year) and the share price (usually from June 30 of the reporting year) are from the company’s 10-K filings.", "Starting in mid-December 2020 the share price moved above $3 and rose to $5.38 at the end of the year. It crept up during January to $7.11 and made an elevator move to $23.72 on February 16. While it gave up more than half to close at $11.77 on March 8, it was essentially range bound between $11 and $18 until the last three days. ", "It popped to close at $26.44 on Monday and has pulled back to $20.99 on Wednesday. This gives it a market cap of about $3.1 billion, 15 times what it was worth most of last year.", "MicroVision is the latest stock picked up by the Reddit crowd", "SwaggyStocks.com", " tracks Reddit’s WallStreetBets positive and negative sentiment on stocks. In early April WallStreetBets had its first significant round of zeroing in on MicroVision. While the stock had already hit its all-time high in February, you can see from the graph that comments about the company have exploded in the past week. This is probably one of the reasons that the stock has rebounded higher.", "MicroVision is heavily shorted", "Ihor Dusaniwsky at S3 Partners analyzes short interest in stocks. From his calculations the company, “continues to be one of our top short squeeze candidates as it is a crowded short with short sellers down significantly in mark-to-market losses over the last month.”", "He estimates that there are about 33 million shares shorted or 21% of its float, with an increase of over 5 million shares in the past 30 days. The percentage drops a bit to 17.5% when synthetic longs created by short sellers are included.", "Note this chart is as of Monday, April 26", "Revenue is small while valuation is high", "MicroVision has seemingly not generated any significant revenue as can be seen in the numbers below. Only two analysts follow the stock and only one of them has a published number for 2022 revenue, ", "per Yahoo! Finance", ". While it is always possible that the company could generate $300 million in revenue if it can get customers to test MicroVision’s lidar products and commit to installing them over the next 20 months, this revenue projection seems to be on the very aggressive side or outdated.", "Using 2019’s revenue to remove any Covid-19 impact and the current market cap of $3.1 billion, the company’s market cap to revenue ratio is 1,077x.", "Using $50 million for 2022’s revenue, which could still be aggressive, makes the market cap to revenue ratio 62x. While this isn’t in the stratosphere, a lot has to go right just to support today’s stock price.", "As a comparison Zoom’s market cap to revenue ratio on its 2022 revenue is 21x.", "And GameStop’s \n ", " \n  ", "GME", " \n ", " valuation at Wednesday’s close of $178.58 gives the company a market cap of $12.1 billion. Its market cap to revenue ratio (also using 2019 revenue) is 1.5x vs. the 0.15x as of December 31, 2020, less than four months ago. It is even worse if you use the analyst’s $5.2 billion revenue estimate for 2022 as the company’s ratio is 2.3x.", "MicroVision has sold stock to cover losses for over a decade", "For over a decade the company has sold stock every year to cover its operating losses. While I didn’t look at all 23 years of 10-K filings, it would not surprise me if the company had negative operating cash flow every year and while it probably didn’t sell stock every year, it has had to go to the markets on a very regular basis.", "Operating cash flow:", "Stock sales:", "Unless it can sell a lot of lidar systems in the near future, MicroVision will probably have to sell more stock."], "clicks": 9993},
{"headline": "GameStop Taps Billionaire Investor Ryan Cohen As Board Chair, Sending Shares Surging Anew", "date": "Apr 8, 2021,", "company": "gamestop", "blog_id": "blogAndPostId/blog/post/5015-606effc11174b20006fdc178", "paragraphs": ["Just three months after joining GameStop's board, Ryan Cohen, the billionaire investor mounting an effort to turnaround and restructure the ailing brick-and-mortar business, has been tapped to head up the company board, once again fueling bullishness among investors who've plowed into the stock at unprecedented levels.", "$1.9 billion. That's how much ", "Cohen", ", who owns roughly 13% of GameStop shares, is worth as of Wednesday's market close, according to ", "Forbes", ".", "GameStop’s unlikely surge has continued with a vengeance (and volatility) since Reddit traders declared it their meme stock of choice in January, as they plowed into Wall Street's most heavily shorted companies. The plight of brick-and-mortar retailers hit GameStop particularly hard over the past decade, wiping out nearly 90% of the stock's gains through the end of 2019 as PC gaming and independent companies like Minecraft gobbled up market share. The firm’s current CEO George Sherman came on board in April 2019, but GameStop's stock began to surge at the tail-end of last year, as 35-year-old Cohen started buying up shares and blasting management for \"lack[ing] the mindset, resources and plan needed to [help GameStop] become a dominant sector player.\" Cohen's growing stake helped him and a couple of his Chewy colleagues earn seats on GameStop's board in January, fueling bullishness among Reddit traders expecting the turnaround.", "GameStop's Executive Shakeup: Here Are The Amazon Veterans Tapped To Lead The Firm's Digital Transformation", " ", "(Forbes)", "After Premarket Drop Traders Still Bullish On GameStop Despite Plan For $1 Billion In New Stock", " ", "(Forbes)", "GameStop, The Second Surge: Anatomy Of A 'Gamma Swarm'", " ", "(Forbes)"], "clicks": 3260}
]